[{"title":" A Closer Look at the Blur effect in Flutter","description":"Often, when we see a blur effect in designs, we just copy the blur values from the design and use them with a backdrop widget, thinking it’s done. Since it’s blurry, it’s tricky to see if it’s right — but it’s “blurry,” so we move forward.\n\nIn this session, we'll dig deeper to understand what’s really going on behind the scenes with the blur effect in Flutter. We’ll use fragment shaders to try out different kinds of blurs and see the differences between them. By doing so, we can make them look just right in our designs.","category":null,"speakers":[{"FullName":"RAOUF RAHICHE","Company":"EasyA","Biography":"I'm a passionate Flutter and Desktop App developer with a passion for crafting exceptional apps that delight users. As a Google Developer Expert in this field, I've had the privilege of speaking at public events in multiple countries and sharing my knowledge through various mediums, including YouTube tutorials and in-depth articles. Contributing to the open-source community is important to me, and I'm always willing to lend a hand on Stack Overflow or offer guidance to fellow developers.","JobTitle":"Software Engineer, GDE For Flutter and Dart","PhotoFileName":"dsc01927.jpg"}]},{"title":"10 reasons you should care about the OWASP Top 10","description":"This talk will give an introduction to the OWASP Top 10 web vulnerabilities by giving an overview of each item and some tips to avoiding these in your projects.","category":null,"speakers":[{"FullName":"Carole Logan","Company":null,"Biography":"Carole is a .NET developer with over 12 years industry experience, building client solutions across many sectors including hospitality, finance and public sector. She is 3x Microsoft MVP in developer technologies category and a 7x Umbraco MVP.","JobTitle":"Principal Engineer","PhotoFileName":"carole.png"}]},{"title":"A journey of the text field API in Jetpack Compose","description":"Jetpack Compose Text team is redesigning the text field APIs. This talk will cover why and how team is approaching this process.\n","category":null,"speakers":[{"FullName":"Anastasia Soboleva","Company":"Google","Biography":"I've been working on Jetpack Compose at Google for several years. Previously contributed to layouts, Material design components and accessibility, and currently I'm focused on text and text input.","JobTitle":"Software Engineer","PhotoFileName":"photo-conf.jpg"}]},{"title":"A love letter to long lines and other DX stories","description":"Writing code is fun! Reading it, not so much.\n\nAs developers we spend as much, if not more time reading code than we do writing it. However we often forget when coding that we're writing for other humans to read as much as we are for computers to execute. \n\nThis talk goes over how to create a better developer experience (DX) in your projects by writing your code with intent. Leading the reader through your codebase should feel like settling in to watch your favourite TV show; enjoyable and unsurprising. \n\nWith this, and other DX skills covered in the talk, we will create maintainable, educational and pleasant to use projects, not only for other developers, but also for our future selves!","category":null,"speakers":[{"FullName":"Jo Franchetti","Company":null,"Biography":"Jo is a Developer Advocate at Spotify working on the Spotify for Developers platform. She is passionate about improving developer experience, teaching good use of the web and building sparkly, wearable, internet connected tech. She mentors junior developers, talks a lot about mental health and is devoted to improving the diversity and inclusivity of the tech industry.","JobTitle":"Developer Advocate","PhotoFileName":"jo-franchetti.jpg"}]},{"title":"AI with Teachable Machine workshop","description":"An engaging and interactive workshop that will introduce you to the exciting possibilities of Teachable Machine, a beginner-friendly tool that empowers individuals to explore and apply AI concepts with ease.","category":null,"speakers":[{"FullName":"Roushanak Rahmat","Company":"QAHE","Biography":"Roushanak is an Computer scientist Lecturer in London. \nPrior to this she was an AI Scientis at a world leading medical tech company, Elekta, Institute of Cancer Research, Cambridge Queens’ College, University of Cambridge, and St. Andrews University. \nShe obtained her PhD in AI at the school of Electrical, Electronics and Computer Engineering at Heriot-Watt University in collaboration with the University of Edinburgh. \nHer research interests are in the fields of medical image analysis and computer vision, where she is developing novel algorithms and models in deep learning to improve healthcare. These structured models allow modeling uncertainty and diversity, which enables novel applications of deep learning from personalization of products and therapies to decision making under uncertainty. \nShe believes AI would revolutionize healthcare and personalize medical treatment in the near future.","JobTitle":"Lecturer","PhotoFileName":"img-20231012-wa0005_0.jpg"}]},{"title":"AI-Powered DevOps: The Next Frontier of DevOps","description":"Artificial intelligence is rapidly transforming our World, and DevOps and Kubernetes is no exception. AI-powered DevOps tools can help teams to automate tasks, improve efficiency, and reduce the risk of errors.\n\nThis talk will explore the latest trends in AI-powered DevOps and discuss how these tools can be used to improve Kubernetes management. We will also discuss the benefits of using AI-powered DevOps tools, such as increased productivity, reduced risk, and improved performance. We will take a look what the cloud native world can offer us with k8sgpt and shellgpt and where Google comes into play. ","category":null,"speakers":[{"FullName":"Mario Fahlandt","Company":"Kubermatic","Biography":"Mario is from a small village in Germany and working for Kubermatic. He studied creative media at an English university and moved his field of knowledge to Cloud Native Infrastructure. He is working as a Customer Delivery Architect with the focus on planning and building concepts and architecture for Infrastructure in the Cloud native world. He started the Google Developer Group for Cloud in Munich back in 2016 and became a Cloud Google Developer Expert in 2019. His passion is always to move the cloud native community one step forward.","JobTitle":"Customer Delivery Architect","PhotoFileName":"gde_bage_hochkant_small.png"}]},{"title":"AI-Powered Insights: A Journey through Cloud Vision AI and PaLM API","description":"In this enlightening session, we will embark on a two-fold exploration. First, we dive into the realm of Cloud Vision AI Firebase extension, where we unravel the intricate process of extracting textual information from images.\n\nDesigned to enhance user experiences and unlock the hidden potential within images, this extension effortlessly extracts text from jpg or png images uploaded to your Cloud Storage.\n\nBut the journey doesn't stop there. Imagine being able to distill the essence of a document into a concise summary, effortlessly transforming information into actionable insights. The Summarize Text with PaLM API Firebase extension is your gateway to achieving just that, seamlessly integrating the power of PaLM API's text summarization capabilities with your Firestore documents.\n\nWith a few simple steps, you'll connect your Firebase app to a world of possibilities:\n- Seamless Setup\n- Automated Extraction\n- Immediate Insights\n- Actionable Insights","category":null,"speakers":[{"FullName":"Aseem Wangoo","Company":"ShopBack","Biography":"This is Aseem Wangoo, founder of Flatteredwithflutter, tech event speaker, content creator, Google Dev Library Contributor, and technical writer. \nCurrently working with SouthEast Asia's largest online loyalty platform, ShopBack\n\nRanked in the Top 30 best flutter blogs. Speaker at Google Singapore and tech events (eg Flutter Meetups etc). Invited as a speaker to FlutterCon Berlin, Geekle, DartUp and other tech communities.\n","JobTitle":"Senior Software Engineer","PhotoFileName":"1678000225676-%281.jpeg"}]},{"title":"Accessibility and Design: Inclusive Future","description":"Here are 3-5 subtopics you can cover during your conversation about accessible design, UI\/UX and technology, design thinking, and design psychology:\n\n1. Accessibility in UI\/UX Design:\n   - Discuss the importance of designing digital products and interfaces that are accessible to users with disabilities.\n   - Explore specific accessibility guidelines, standards, and best practices, such as WCAG (Web Content Accessibility Guidelines), and how they impact UI\/UX design.\n   - Share examples of successful accessible design implementations and their positive impact on user experiences.\n\n2. Technology's Role in Accessibility:\n   - Examine the role of technology, including assistive technologies, in improving accessibility for individuals with disabilities.\n   - Discuss emerging technologies (e.g., AI, voice recognition, haptic feedback) and their potential to enhance accessibility in UI\/UX design.\n   - Address the challenges and opportunities associated with staying up-to-date with evolving technology trends in the context of accessible design.\n\n3. Design Thinking and Accessibility:\n   - Explain how the principles of design thinking can be applied to create more inclusive and user-centered design solutions.\n   - Share design thinking methodologies and their applicability to solving accessibility-related challenges.\n   - Highlight the iterative nature of design thinking and its alignment with continuous improvement in accessible design.\n\n4. Psychology of User Experience:\n   - Explore the psychological aspects of user experience design, such as cognitive load, visual perception, and emotional design.\n   - Discuss how an understanding of user psychology can inform UI\/UX decisions and lead to more engaging and effective designs.\n   - Provide examples of how design psychology principles have been used to create memorable user experiences.\n\n5. Ethical Considerations in Design:\n   - Touch upon the ethical responsibilities of UI\/UX designers, particularly in relation to accessibility and inclusivity.\n   - Discuss the potential consequences of neglecting accessibility in design and the ethical imperative to prioritize it.\n   - Delve into case studies or real-world examples where ethical considerations played a significant role in design decisions.\n\nConclusion:\nEnding Note and a Summary and few steps everyone can follow","category":null,"speakers":[{"FullName":"gauri thakur","Company":"B&Q","Biography":"The world can be an overwhelming place, so I help people connect with experiences and brands by telling stories as a UI\/UX and product designer. ‘\n\nHi, I'm Gauri Thakur! I am currently working as product designer for B&Q . My passion for design took the front forth in my life since I was 16. I taught myself through YouTube, numerous internships and just by following other designers. After 5 years, I completed my master's to bridge all the remaining gaps. \n\n\nI love seeing my designs come to life and helping users accomplish their goals. My knowledge of design principles, the software has always proven to be an upside for my projects. I believe in creating designs that are intuitive, accessible, transparent, and user friendly. I also believe in watching the same old movies again. Other than designing I love to talk about philosophy, sketch, cook, and hike.\n\n","JobTitle":"Product Desiner","PhotoFileName":"beige-aesthetic-feminine-business-twitter-profile-picture-%281-copy.png"}]},{"title":"Accessible Design: Future for UI\/UX","description":"Here are 3-5 subtopics you can cover during your conversation about accessible design, UI\/UX and technology, design thinking, and design psychology:\n\n1. Accessibility in UI\/UX Design:\n   - Discuss the importance of designing digital products and interfaces that are accessible to users with disabilities.\n   - Explore specific accessibility guidelines, standards, and best practices, such as WCAG (Web Content Accessibility Guidelines), and how they impact UI\/UX design.\n   - Share examples of successful accessible design implementations and their positive impact on user experiences.\n\n2. Technology's Role in Accessibility:\n   - Examine the role of technology, including assistive technologies, in improving accessibility for individuals with disabilities.\n   - Discuss emerging technologies (e.g., AI, voice recognition, haptic feedback) and their potential to enhance accessibility in UI\/UX design.\n   - Address the challenges and opportunities associated with staying up-to-date with evolving technology trends in the context of accessible design.\n\n3. Design Thinking and Accessibility:\n   - Explain how the principles of design thinking can be applied to create more inclusive and user-centered design solutions.\n   - Share design thinking methodologies and their applicability to solving accessibility-related challenges.\n   - Highlight the iterative nature of design thinking and its alignment with continuous improvement in accessible design.\n\n4. Psychology of User Experience:\n   - Explore the psychological aspects of user experience design, such as cognitive load, visual perception, and emotional design.\n   - Discuss how an understanding of user psychology can inform UI\/UX decisions and lead to more engaging and effective designs.\n   - Provide examples of how design psychology principles have been used to create memorable user experiences.\n\n5. Ethical Considerations in Design:\n   - Touch upon the ethical responsibilities of UI\/UX designers, particularly in relation to accessibility and inclusivity.\n   - Discuss the potential consequences of neglecting accessibility in design and the ethical imperative to prioritize it.\n   - Delve into case studies or real-world examples where ethical considerations played a significant role in design decisions.\n\nConclusion: \nEnding Note and a Summary and few steps everyone can follow\n","category":null,"speakers":[{"FullName":"gauri thakur","Company":"B&Q","Biography":"The world can be an overwhelming place, so I help people connect with experiences and brands by telling stories as a UI\/UX and product designer. ‘\n\nHi, I'm Gauri Thakur! I am currently working as product designer for B&Q . My passion for design took the front forth in my life since I was 16. I taught myself through YouTube, numerous internships and just by following other designers. After 5 years, I completed my master's to bridge all the remaining gaps and worked on multiple research project to understand accessibility and design better. \n\nI love seeing my designs come to life and helping users accomplish their goals. My knowledge of design principles, the software has always proven to be an upside for my projects. I believe in creating designs that are intuitive, accessible, transparent, and user friendly. I also believe in watching the same old movies again. Other than designing I love to talk about philosophy, sketch, cook, and hike.\n","JobTitle":"Product Desiner","PhotoFileName":"beige-aesthetic-feminine-business-twitter-profile-picture-%281-copy.png"}]},{"title":"Android apps: be your own architect! ","description":"Layer your codebase to be scalable, reusable and efficient. Overview of different historical architectural approaches in Android - with a focus on the currently recommended one.","category":null,"speakers":[{"FullName":"Slobodan Manojlović","Company":"JP Morgan Chase","Biography":"Language interpreter in a previous life converted to interpreting ideas and converting them to software. Passionate native Android developer since 2016. ","JobTitle":"Senior Associate \/ Android Tech Lead","PhotoFileName":"pxl_20211110_084248558.portrait_0.jpg"}]},{"title":"Bard in Action: Empowering Flutter Apps with JavaScript-Dart Inteoperability","description":"This talk is ideal for developers who are already familiar with Flutter and want to explore its potential for web development. We delve into state management between Flutter and JavaScript, and showcase how to customize Flutter web app initialization.\n\nBy utilizing the js package, we demonstrate how to leverage the @JSExport attribute to enable seamless interoperability between JavaScript and Dart code, showcasing its power with an exciting scenario.\n\nWe leverage the potential of interoperability to integrate Bard into Flutter Web. There are three essential steps to follow.\n\n- Setting up a localhost server to invoke the PaLM APIs.\n- Developing a plain vanilla JavaScript and HTML mock of the Bard UI in a Flutter web project.\n- Integrating the localhost server into the Flutter web app, involving Element embedding.\n\nElement Embedding, allows developers to embed Flutter content into any web application using an HTML element. This feature combines the performance of Flutter with the flexibility of the web, enabling the creation of intricate user interfaces","category":null,"speakers":[{"FullName":"Aseem Wangoo","Company":"ShopBack","Biography":"This is Aseem Wangoo, founder of Flatteredwithflutter, tech event speaker, content creator, Google Dev Library Contributor, and technical writer. \nCurrently working with SouthEast Asia's largest online loyalty platform, ShopBack\n\nRanked in the Top 30 best flutter blogs. Speaker at Google Singapore and tech events (eg Flutter Meetups etc). Invited as a speaker to FlutterCon Berlin, Geekle, DartUp and other tech communities.\n","JobTitle":"Senior Software Engineer","PhotoFileName":"1678000225676-%281.jpeg"}]},{"title":"Beyond Flutter: JniGen and Ffigen for Seamless Interoperability and native integration","description":"In the ever-evolving landscape of mobile app development, combining the power of native code with the flexibility of Flutter has become a game-changer. Enter JniGen and Ffigen, two cutting-edge tools that help in streamlining native integration and enhancing cross-platform performance.\n\nJniGen, a powerful tool that automates the generation of Dart bindings for a given Java API, eliminating the need for manual boilerplate code. Beyond Java, package:jnigen goes the extra mile by compiling Kotlin to Java bytecode, thereby extending its capacity to generate bindings for Kotlin as well.\n\nBut the journey doesn't end there! With Ffigen, developers can take interoperability to new heights by incorporating existing C libraries into Flutter apps, reducing development time and effort while retaining full control over memory management and garbage collection.\n\nDuring this session, we will delve into the inner workings of JniGen and Ffigen, guiding developers through the steps of leveraging their power to create dynamic cross-platform apps.\n","category":null,"speakers":[{"FullName":"Aseem Wangoo","Company":"ShopBack","Biography":"This is Aseem Wangoo, founder of Flatteredwithflutter, tech event speaker, content creator, Google Dev Library Contributor, and technical writer. \nCurrently working with SouthEast Asia's largest online loyalty platform, ShopBack\n\nRanked in the Top 30 best flutter blogs. Speaker at Google Singapore and tech events (eg Flutter Meetups etc). Invited as a speaker to FlutterCon Berlin, Geekle, DartUp and other tech communities.\n","JobTitle":"Senior Software Engineer","PhotoFileName":"1678000225676-%281.jpeg"}]},{"title":"Beyond the Stage Lights: Freddie Mercury's Electric Encore as a Software Developer","description":"Having left Queen, world wide sell out stadium tours and albums behind, Freddie invites you to join him for a day in his new life as a software developer.\n\nOn this journey Freddie will be diving into a performance issue that is affecting a small number of high value customers to the extent the product is near unusable for them.\n\nFind out what happens as Freddie attempts to resolve the issue while making a huge number of costume changes!","category":null,"speakers":[{"FullName":"Peter Aitken","Company":"Litmus","Biography":"Meet Peter, who likes to spend his time spreading joy like a daft fairy godmother. \nHaving spent the last few years recovering from organising ScotlandJS, ScotlandCSS and Global Diversity CFP Day he wants to bring his community focus to giving tech talks again.\n\nBy day he is a Principal Software Engineer at Litmus, using Ruby and JavaScript. \nIn his spare time, you can find him walking the dogs, avoiding housework and playing guitar and mandolin.\n\nSo, buckle up, because Peter is here to make life a wee bit funnier and a whole lot weirder!","JobTitle":"Principal Software Engineer","PhotoFileName":"jiggy_pete_400x400.jpg"}]},{"title":"BioNER: Not all NER is state of the art (yet)","description":"Named entity recognition is a problem considered solved in the NLP community. However, in the Biomedical domain, there is a huge scope for improvement. In this talk, I will go over what makes BioNER different from NER and what are the challenges in BoiNER that make it an interesting problem to tackle.","category":null,"speakers":[{"FullName":"Dhruv Kumar Patwari","Company":"Code Cadets","Biography":"An MSc Data Science graduate from the University of Glasgow with 2 years of professional experience. Worked on various projects mainly focused on Data Science. I publish my learnings on my blog. Built additional developmental abilities by organizing various events and participating in multiple coding competitions. I aspire to work on cutting‑edge technologies in Data Science.","JobTitle":"Tutor","PhotoFileName":"dhruv-kumar-patwari_datatalent23robertoheadshots_103240.jpg"}]},{"title":"Breaking Down Barriers","description":"Success is possible for everyone in the tech industry. In this session, we will discuss strategies and best practices to help us overcome challenges and barriers in the tech industry. The session will also share success stories of those who have overcome barriers and highlight the importance of making tech education accessible to people of all backgrounds and skill levels.","category":null,"speakers":[{"FullName":"Angeline Nesbitt","Company":"Angeline Nesbitt","Biography":"My name is Angeline Nesbitt. An expert software engineer and a computer science lecturer. \nBesides my work as a software engineer and computer science lecturer, I mentor many in the community and run coding boot camps in order to address the problem of tech skill gaps affecting minorities. I am extremely passionate about the issue of a tech skills gap in the black community and would like to do a talk at DevFests to talk about inclusion and the need to empower more underrepresented communities in the tech industry.\n\nThank you for taking the time to read my biography. Let's work together to create a more inclusive and diverse tech industry.\nI am also happy to assist with any workshop in order to share my knowledge and experience.\n\n","JobTitle":null,"PhotoFileName":"178427228_4406558342705186_8979583256462831177_n.jpg"}]},{"title":"Bringing the Cloud down to earth and making sense of the nebulous - a GCP perspective","description":"Wiktor combines humour with practical insights to demystify cloud computing. The talk offers valuable advice for those starting their cloud careers, emphasizing the importance of hands-on experience and the willingness to explore the endless possibilities of cloud platforms like Google Cloud.\n\nWiktor steps you through how to create your own 'cloud portfolio' and over-engineer a simple 'Hello World' application. The talk provides real-world examples and insights on how cloud services are used in building an application.","category":null,"speakers":[{"FullName":"Wiktor Jurek","Company":"Cobry \/ University of Strathclyde","Biography":"Wiktor is a Google Cloud Engineer working for Cobry, a Google Cloud partner based in Glasgow. He focuses on data engineering and analysis, as well as application development on the Google Cloud Ecosystem.","JobTitle":"Development Lead","PhotoFileName":"screenshot-2023-10-02-145921.png"}]},{"title":"Build amazing web apps with WebAssembly","description":"Uncover the vast potential of WebAssembly (Wasm) in the realm of web development. Dive deep into its core principles while discovering practical, real-world applications where it seamlessly integrates with JavaScript. Explore how Wasm elevates web applications across diverse domains and use cases, revolutionizing the way we build for the web.\n\nJoin us on an enlightening journey into the limitless possibilities of WebAssembly. This talk promises to equip you with invaluable insights and tools to harness the true power of Wasm in your web development projects.","category":null,"speakers":[{"FullName":"Önder Ceylan","Company":"IKIGAI Ventures","Biography":"Önder has been working on building web and mobile apps in various development ecosystems since late 90s. JavaScript and web has always been his passion and nowadays he enjoys it at its full while working as an independent contractor. He believes in team work and he shares his knowledge with the communities as a co-organiser and speaker. He's also interested in photography, movies and dancing.","JobTitle":"Technical Lead","PhotoFileName":"fuji-sq-large.jpg"}]},{"title":"Build your first game with Flutter & Flame","description":"Dive into the exciting world of game development and master Flutter, Dart, and the Flame game engine in this workshop. Perfect for all skill levels, this hands-on experience teaches you how to create your own interactive game. Using Flame, a powerful 2D game engine, you'll craft stunning games effortlessly.\n\nBy the workshop's end, you'll have a fully functional game and valuable skills in Flutter, Dart, and Flame. Join me and transform your game ideas into reality!","category":null,"speakers":[{"FullName":"Akanksha Singh","Company":"JP Morgan Chase & Co.","Biography":"Akanksha is a Software Engineer at JP Morgan Chase & Co., crafting engaging and innovative software solutions. She has a keen interest in Flutter and enjoys building user-friendly and accessible applications. Her passion for Flutter has taken her to international conferences like FlutterHeroes, FlutterCon, and Flutter & Friends where she has shared her insights and expertise.\n\nBeyond her role, Akanksha is an avid participant in hackathons. Her passion for community building and mentorship has driven her to lead student communities at university and mentoring roles at prestigious hackathons like HackHarvard, Hack4Inclusion, HackTheNorth, DubHacks, CalHacks, and more. \n\nWhen she steps away from her keyboard, Akanksha finds solace in the timeless melodies of 60s-70s Hindi songs. She's an avid museum-goer, ignited by a deep passion for delving into the realms of art and history.\n","JobTitle":"Software Engineer","PhotoFileName":"akanksha_singh.png"}]},{"title":"Building and iterating products rapidly with Firebase, Cloud Functions and GCP.","description":"The transition from impressive engineering projects to successful products often poses challenges for skilled engineers. Crafting a product that gains traction, revenue, and a dedicated user base takes longer than creating technical solutions. Projects allow engineers to explore technology freely, while products require a user-centric approach and awareness strategy.\n\nFor new products, flexibility, deep insight, luck, capital, and a strong team are crucial. User interaction, empathy, market research, and user engagement are vital. Shifting focus from technical prowess to problem-solving and creating a brand presence early on is important.\n\nHow Firebase, Google Cloud Functions, and Google Cloud Platforms allow for rapid achieve iteration while building startups and products, and why it fulfills the need from indie hackers to big funded startups.\n\nHow suites of Google Cloud products allow you to build highly scalable, redundant while pivoting rapidly and building new features.","category":null,"speakers":[{"FullName":"Raj Gaurav Maurya","Company":"University of London","Biography":"I am Raj Gaurav, MLH Top50 2023 Hacker, a senior at the University of London, So far, I have interned at DPS Munich, Solana Labs, and Hyperledger, building InfiOpp and Out In Tech Banglore chapter.\n\nI always volunteer at coding boot camps, hackathons, and open-source projects.\nCurrently, I am mentoring at 100xDevs, and in the past, I have mentored at The Collab Lab, HackYourFuture, SheCodeAfrica, CodePath, 40+hackathons, CodeDay Banglore, UR Hackathon3.0, and a lot more.\n\nI have built full-stack chat applications, blogging platforms, cross-platform applications, data scraper, and visualization software, and more end-to-end.\n\nI have conducted multiple workshops, led the sessions(The Collab Lab), and appeared on podcasts such as Showwcase and a lot more.","JobTitle":"Software Engineer @ FOSSMentoring","PhotoFileName":"profile.jpg"}]},{"title":"Building your first Machine Learning Model","description":"This workshop would give people an insight into building their first predictive and classification model using Scikit-Learn.\nWe would be following the usual norm of building the model, by using a csv data format.\nSome concepts of pandas and numpy will also be taught. ","category":null,"speakers":[{"FullName":"Venkatesh Giri","Company":"Barclays","Biography":"Software Developer with over a year of professional experience and six months of internship experience. Skilled in Python, C++, Java, and JavaScript. Published a Machine Learning Research paper in the ITU Journal.\nLink: https:\/\/www.itu.int\/pub\/S-JNL-VOL3.ISSUE2-2022-A15 ","JobTitle":"Software Developer ","PhotoFileName":"15737.jpg"}]},{"title":"Cleaner Flutter Code with Dart 3","description":"Dart 3 has ushered in a multitude of major features that empower Flutter developers to craft cleaner, more aesthetically pleasing Dart code than ever before. Furthermore, these features prioritize code safety, elevating the reliability of our applications. In this talk, we'll take a deep look at the exciting new features introduced in Dart 3. It caters to a diverse audience, regardless of their level of experience, because Dart 3 is a recent and evolving development in the programming landscape.\n\nThe significance of this topic cannot be overstated, as the effectiveness of Dart and Flutter, along with the entire ecosystem, hinges on our ability to write productive Dart code. It heavily emphasizes practicality, with numerous code examples that not only demonstrate how to use Dart 3 features but also elucidate why and when they should be applied. While a solid understanding of Dart 3 features is beneficial, rest assured that I'll guide you to my recommended resources for further exploration.","category":null,"speakers":[{"FullName":"Akanksha Singh","Company":"JP Morgan Chase & Co.","Biography":"Akanksha is a Software Engineer at JP Morgan Chase & Co., crafting engaging and innovative software solutions. She has a keen interest in Flutter and enjoys building user-friendly and accessible applications. Her passion for Flutter has taken her to international conferences like FlutterHeroes, FlutterCon, and Flutter & Friends where she has shared her insights and expertise.\n\nBeyond her role, Akanksha is an avid participant in hackathons. Her passion for community building and mentorship is evident through her leadership in student communities at university and mentoring roles at prestigious hackathons like HackHarvard, Hack4Inclusion, HackTheNorth, DubHacks, CalHacks, and more. \n\nWhen she steps away from her keyboard, Akanksha finds solace in the timeless melodies of 60s-70s Hindi songs. She's also an avid movie buff and enjoys exploring museums whenever possible. ","JobTitle":"Software Engineer","PhotoFileName":"acs_0186-%281.jpg"}]},{"title":"Coding in no-code: Extending AppSheet functionality ... with code","description":"Google AppSheet is a powerful no-code platform for the rapid development of apps. Vikas Anand (Google Cloud) has noted \"the democratization of software creation is also gaining ground within organizations, and by 2024 more than 65% of applications will be developed by low-code tools\".\n\nWhilst tools like AppSheet are pitched at no\/low coders it doesn't mean there are no coding opportunities. In this talk we will highlight how AppSheet can be integrated with other Google products and services including Vertex AI, Workspace APIs and more! This session will also be an opportunity to see how with Duet AI for AppSheet developers can go from zero to prototype in a matter of minutes.\n\nAttending this session will give participants the opportunity to learn about the capabilities of Google AppSheet and opportunities for it to be used to create muti-platform interfaces to other products and services.","category":null,"speakers":[{"FullName":"Martin Hawksey","Company":"CTS","Biography":"Martin has held advisory roles within the UK educational technology sector for a number of government-funded services. In 2010 he started exploring and sharing solutions using Google Apps Script often integrating other Google products, such as Google Maps, Dialogflow and Google Analytics. Martin is a Collaboration Engineer at the largest dedicated Google Cloud practice in Europe, CTS. In this role he helps Google Workspace users identify opportunities to improve work processes, leads change through collaboration and develops solutions with Google Apps Script and Google AppSheet. He continues to support the wider Google Workspace developer community as co-host\/producer of the Totally Unscripted podcast and the AppsScriptPulse website.","JobTitle":"Collaboration Engineer","PhotoFileName":"dsc_7159-gde-badge-2023.jpeg"}]},{"title":"Create a Generative Chat App with Vertex AI Conversation","description":"In this short workshop, you'll use Generative AI Agent functionality in Vertex AI Conversation to build, configure, and deploy a virtual agent that can assist customers who have questions about products and devices in the Google Store, including phones, watches, laptops, smart home devices, and other consumer devices.","category":null,"speakers":[{"FullName":"Ishita Narsiker","Company":"University of Glasgow","Biography":"I'm Ishita Narsiker, a Computer Science undergraduate student at the University of Glasgow, here! 🎓 Being invited to events like the Google APM summit and my Software Engineering Internship at JP Morgan has truly fueled my passion for Web Development and Product Management. 💻✨ In addition to my academic pursuits, I actively engage in community-based initiatives around Women in Technology. As an organizer at GDG Glasgow and WomenTechmakers Scotland, I strive to create inclusive spaces and empower fellow tech enthusiasts. 🌟💪 I'm also proud to be a GitHub Campus Expert 🚩 for Scotland, where I help bridge the gap between students & industry leaders 🚀 When I'm not coding, you can find me dancing my heart out! 💃 It's my way of staying balanced and embracing creativity","JobTitle":"Final Year Computer Science Undergraduate","PhotoFileName":"headshot.jpg"}]},{"title":"Cultivating Digital Brilliance: Unveiling the Power of Google Cloud Operation Suite for Seamless Monitoring and Logging in the Cloud Era\"","description":"In today's digital landscape, where businesses thrive on innovation and agility, managing complex cloud infrastructures has become pivotal. We are here to explore how Google Cloud Operation Suite, a powerful set of tools and services, can transform the way we monitor, manage, and optimize our digital operations.\n\nImagine a world where you can foresee potential issues before they impact your services, gain deep insights into your applications’ performance, and ensure security and compliance across your entire cloud ecosystem. This is precisely what Google Cloud Operation Suite offers a comprehensive suite of solutions designed to make your cloud operations seamless and efficient.\nGet ready to unlock the full potential of your digital landscape. Let’s embark on this enlightening journey together and pave the way for a future where your operations are not just efficient but truly brilliant.","category":null,"speakers":[{"FullName":"Santosh Kumar Perumal","Company":"Tata Consultancy Services","Biography":"Santosh boasts an impressive 9-year tenure in the software industry, showcasing expertise ranging from software development to cloud computing. Located in London, he is not only a seasoned professional but also an active public speaker. His contributions to various community forums, including CD Foundation, Google WomenTechMaker, Calico, and Open UK, reflect his dedication as an ambassador. Through platforms like LinkedIn, Santosh has used his voice to assist others, earning recognition as a Top Voice for Cloud Computing. His passion for continuous learning, mentoring, and community building highlights his proactive and influential role within the tech community.","JobTitle":"Google Cloud Consultant","PhotoFileName":"santosh-kumar-ss-e1685011545633.jpg"}]},{"title":"Dare to break the silence ","description":"The technology industry is known for its fast-paced, competitive environment. This can lead to high levels of stress, anxiety, and burnout, which can have a negative impact on mental health. However, there is still a stigma surrounding mental health in tech, which makes it difficult for people to seek help and support.\n\nThis talk will explore the mental health challenges faced by people in tech and discuss how to break the silence on this important issue. Talking from personal experience on how I went from a struggling developer to a Thriving technical director. And how I'm using my experience and disorder to show the world someone with a serious mental health condition can be a developer!","category":null,"speakers":[{"FullName":"Faye Mckeown","Company":null,"Biography":"A senior mobile software engineer with a personality disorder who is on a mission to change the way the technology industry talks about mental health. With over 10 years of experience in the industry, and have worked on a variety of projects, from developing new features for popular smart home tech business to building infrastructure for large enterprise companies.\n\nI have always been passionate about mental health awareness, but it wasn't until I was diagnosed with a personality disorder i decided to speak out publicly about my experiences. I believe that the tech industry has a long way to go in terms of supporting its employees with mental health challenges, and they are committed to making a difference.\n\nI am a regular speaker at industry events, conferences and google online events, where I share my story and insights on how to create a more inclusive and supportive workplace for people with mental health conditions. I am also the founder of a non-profit organization that provides resources and support to people in the tech industry who are struggling with mental health challenges.\n\nMy work has had a significant impact on the way the tech industry is talking about mental health. Was recently awarded Google Developer Community Champion and have helped to break down the stigma surrounding mental illness and to create a more supportive environment for people who are struggling.","JobTitle":null,"PhotoFileName":"20220613_170435.jpg"}]},{"title":"Data and Ethics - how applying ethical thinking can make handling data easy.","description":"For ethical considerations for the capture, storing and handling of data. What should be considered? How can you make those considerations part of a clear ethical data governance framework that covers both the ethics and the legal and regulatory requirements? This talk covers real world examples, expensive mistakes and what lessons we can learn from them to apply to our own work. ","category":null,"speakers":[{"FullName":"nicholas shearer","Company":"University of Strathclyde \/ Freelance Consultant","Biography":"Nicholas is a Data Ethicist who has worked with technology for 30+ years. A web designer since the early 90’s, a database administrator, an analyst, a champion of UX, a Prince 2 project manager, a tech writer and a frustrated development manager wondering how the scope creep of waterfall has now been replaced by the scope creep of agile frameworks. \nCurrent focus is data privacy, data consent and ethical accountability, from data capture to reporting and data use in AI. \n","JobTitle":"Data Ethicist","PhotoFileName":"nik.jpg"}]},{"title":"Effective work with background in Flutter","description":"Effective collaboration between Isolates will be presented and explained what and why need to be added to have easy going background service in Flutter.\nThis is a basics for effective background work.","category":null,"speakers":[{"FullName":"Vadym Pinchuk","Company":"Labrys","Biography":"I am a passionate mobile Software Engineer with Ukrainian origins, currently residing in London, UK. My journey commenced as an Android Developer in early 2012, and in 2018, I became an active member of the Flutter community.\nDuring last two years I worked as an Android Developer at Instagram, but now returned back to the tech stack I love as a Flutter Developer at Labrys.","JobTitle":"Senior Software Engineer","PhotoFileName":"pictures_london2023-3.jpg"}]},{"title":"Empower the Power of AI in Your Flutter Application with AI Firebase Ext","description":"Embark on a journey to supercharge your Flutter applications with the groundbreaking fusion of Firebase and Artificial Intelligence. Join us for an engaging talk where we unravel the potential of AI Firebase Extensions and how they can elevate the intelligence of your Flutter projects.\n\nDiscover how seamlessly integrating AI capabilities into your Firebase-powered Flutter app can open doors to enhanced user experiences, intelligent analytics, and streamlined workflows. We'll explore the practical implementation of Firebase Extensions that leverage the power of machine learning, making complex tasks feel like a breeze.\n\nFrom sentiment analysis to image recognition, witness firsthand how these extensions can transform your app into a smart, adaptive, and user-centric powerhouse. Whether you're a Firebase enthusiast or a Flutter aficionado, this talk is designed to empower you with the tools and knowledge to harness the true potential of AI in your applications.\n\nJoin us for an enlightening session that combines the best of Firebase and AI, and learn how to turn your Flutter app into a cutting-edge, intelligent solution. Don't miss out on this opportunity to revolutionize your development journey—see you at the talk!","category":null,"speakers":[{"FullName":"Renuka Kelkar","Company":"invertase","Biography":"Renuka Kelkar is DevRel Advocate @ Invertase and GDE for Flutter and Dart. Founder of TechPowerGirls Community. She is also an organiser for GDG London and a Womentechmaker ambassador.","JobTitle":"DevRel Advocate","PhotoFileName":"81cb-200o200o2-aghj3j36olzzghnwywyfvm.png"}]},{"title":"Empowering Your ML Journey with Vertex AI and AutoML: Mastering Machine Learning's Three Acts","description":"Welcome to the exciting workshop, where you'll dive headfirst into the world of Vertex AI. We're here to demystify the journey of machine learning, and it's going to be a thrilling ride!\n\nImagine it like a three-act play. Act one: Data Preparation. I'll show you how to get your data in tip-top shape, a critical step in the machine-learning process. Then comes Act Two: Model Training. You'll learn the secrets of crafting powerful machine-learning models that can change the game. Finally, act three: Model Deployment. Discover how to unleash your models into the real world where they can make a difference.\n\nBut here's the twist - we've got a whole toolbox of Vertex AI products to guide you through each act. These tools are like your trusty sidekicks, ready to assist you at every turn.\n\nAnd guess what? It's not just theory; I'll take you into the trenches with a live lab environment. You'll get hands-on experience building a machine-learning model with Vertex AI base models and custom models.\n\nSo, if you're curious about the ML, Vertex AI and itching to dive in, this is a chance. Join us on this journey, and by the end of the workshop, you'll be the one casting spells with AI. Don't miss out on the adventure!","category":null,"speakers":[{"FullName":"Vasudev Maduri","Company":"Admiral Group","Biography":"Vasudev is a seasoned professional currently serving as a Staff Data Engineer at Admiral Group. With a wealth of experience in the realms of Google Cloud Platform (GCP), big data, and data architectures, Vasudev has consistently demonstrated his prowess in implementing industry-leading products recognized by Gartner.\n\nHis journey in the world of technology has encompassed stints at renowned organizations like Hitachi and Ford, where he honed his expertise in data engineering and analysis. Vasudev is not only a practitioner but also an active mentor, deeply committed to fostering talent and contributing to open-source technologies.\n\nAs a thought leader in his field, Vasudev has shared his insights and knowledge with a global audience through over 30 impactful talks. Vasudev continues to inspire and innovate, driving transformative change in the world of data and technology.","JobTitle":"Staff Data Engineer","PhotoFileName":"vasupp.png"}]},{"title":"Ensuring Reliability of Large Scale ML Systems","description":"Machine learning is frequently regarded as enigmatic or unfathomable. As a result, SREs may prefer to work around ML-related reliability issues in their systems rather than through them. This avoidance is not only costly but also unnecessary—any given SRE may operate with systems that they do not fully understand. To control risk, they employ a set of generic methodologies to comprehend the system's attributes and failure modes.\n\nWe apply this outside-in strategy to ML reliability in this talk, based on recent experiences with a large-scale ML production platform. We discuss frequent failure modes and suggest best practices for productionization based on these failure modes like System monitoring and protection against human error, Understand data integrity requirements. Prioritize pipeline workloads for efficiency and backlog recovery.","category":null,"speakers":[{"FullName":"Vasudev Maduri","Company":"Admiral Group","Biography":"Vasudev is a seasoned professional serving as a Staff Data Engineer at Admiral Group. With a wealth of experience in the realms of Google Cloud Platform (GCP), big data, and data architecture, Vasudev has consistently demonstrated his prowess in implementing industry-leading products recognized by Gartner.\n\nHis journey in the world of technology has encompassed stints at renowned organizations like Hitachi and Ford, where he honed his expertise in data engineering and analysis. Vasudev is a practitioner and an active mentor, deeply committed to fostering talent and contributing to open-source technologies.\n\nAs a thought leader in his field, Vasudev has shared his insights and knowledge with a global audience through over 30 impactful talks. Vasudev continues to inspire and innovate, driving transformative change in the world of data and technology.","JobTitle":"Staff Data Engineer","PhotoFileName":"vasupp.png"}]},{"title":"Exploring the Art of MLOps for deploying Large Language Models using Vertex AI","description":"This talk will discuss in detail about the need of MLOps in the current ecosystem and how MLOps can increase the release to market . This will also discuss in detail about how to leverage capabilities in Google Vertex AI to implement State of the Art MLOps pipelines to deploy Large Language Models in Google Cloud.","category":null,"speakers":[{"FullName":"Nishi Ajmera","Company":null,"Biography":"Nishi Ajmera is a full stack developer who is passionate about emerging new technologies. With a keen interest in web development, she has gained expertise in various programming languages, frameworks, and tools.\nApart from her professional expertise, Nishi is a public speaker and has delivered multiple sessions at various Google Developer group talks and Javascript meetups.\nWhen she's not coding or reading, Nishi can be found exploring new places and cuisines. She believes that traveling and trying new things is a great way to keep her mind fresh and inspired.","JobTitle":null,"PhotoFileName":"screenshot-2023-08-30-at-16.42.45.png"}]},{"title":"Fine-Tuning LLMs using Google’s Vertex AI","description":"In this talk we will walk you through the challenges and techniques that can help you fine-tune your own LLMs. This talsk will also explore the powerful capabilities of Google's Vertex AI platform for fine-tuning Large Language Models (LLMs).","category":null,"speakers":[{"FullName":"Nishi Ajmera","Company":null,"Biography":"Nishi Ajmera is a full stack developer who is passionate about emerging new technologies in the web development field. With a keen interest in web development, she has gained expertise in various programming languages, frameworks, and tools.\nApart from her professional expertise, Nishi is a public speaker and has delivered multiple sessions at various Google Developer group talks and Javascript meetups.\nWhen she's not coding or reading, Nishi can be found exploring new places and cuisines. She believes that traveling and trying new things is a great way to keep her mind fresh and inspired.","JobTitle":null,"PhotoFileName":"screenshot-2023-08-30-at-16.42.45.png"}]},{"title":"Flutter and Bard fusion: Empowering Flutter Apps with JavaScript-Dart Interoperability","description":"This talk is ideal for developers who are already familiar with Flutter and want to explore its potential for web development. We delve into state management between Flutter and JavaScript, and showcase how to customize Flutter web app initialization.\n\nBy utilizing the js package, we demonstrate how to leverage the @JSExport attribute to enable seamless interoperability between JavaScript and Dart code, showcasing its power with an exciting scenario.\n\nWe leverage the potential of interoperability to integrate Bard into Flutter Web. There are three essential steps to follow.\n\n- Setting up a localhost server to invoke the PaLM APIs.\n- Developing a plain vanilla JavaScript and HTML mock of the Bard UI in a Flutter web project.\n- Integrating the localhost server into the Flutter web app, involving Element embedding.\n\nElement Embedding, allows developers to embed Flutter content into any web application using an HTML element. This feature combines the performance of Flutter with the flexibility of the web, enabling the creation of intricate user interfaces.\n","category":null,"speakers":[{"FullName":"Aseem Wangoo","Company":"ShopBack","Biography":"This is Aseem Wangoo, founder of Flatteredwithflutter, tech event speaker, content creator, Google Dev Library Contributor, and technical writer. \nCurrently working with SouthEast Asia's largest online loyalty platform, ShopBack\n\nRanked in the Top 30 best flutter blogs. Speaker at Google Singapore and tech events (eg Flutter Meetups etc). Invited as a speaker to FlutterCon Berlin, Geekle, DartUp and other tech communities.\n","JobTitle":"Senior Software Engineer","PhotoFileName":"1678000225676.jpeg"}]},{"title":"Fortifying your Cloud Infrastructure With GCP Security Tools","description":"This session covers the powerful security features provided by Google Cloud Platform (GCP) and demos on how to enhance the security of one's infrastructure. The audience will see how to leverage Private Service Access and IAP tunneling to establish secure connections between VPC resources and GCP-managed services, ensuring data integrity and minimizing exposure to external threats.","category":null,"speakers":[{"FullName":"Paul Asalu","Company":"Momenttrack\/University of Lagos","Biography":"Paul is a final-year computer engineering student, and software developer at Momenttrack, a startup that's focused on automating logistics and providing analytics for manufacturing companies. He is passionate about using technology to solve real-world problems, and in light of that, is very excited to share his experience in doing that - with others.","JobTitle":"Software Developer","PhotoFileName":"pxl_20230611_224847942.portrait~2.jpg"}]},{"title":"From big to small. Which path I choose and why?","description":"This is a lightning talk where I will share my experience as an engineer from Instagram, who decided to resign and work in \"tech for good\". What are the pros of being employed by tech giants, and where to find passion?","category":null,"speakers":[{"FullName":"Vadym Pinchuk","Company":"Labrys","Biography":"Greetings to the mobile community! I am a passionate mobile Software Engineer with Ukrainian origins, currently residing in London, UK. My journey commenced as an Android Developer in early 2012, and in 2018, I became an active member of the Flutter community.\nDuring last two years I worked as an Android Developer at Instagram, but now returned back to the tech stack I love as a Flutter Developer at Labrys.","JobTitle":"Mobile Software Engineer","PhotoFileName":"9134717.jpeg"}]},{"title":"GDG Academy","description":"The Academy is a mentorship program for university students, I'll be talking about how it works, what problem is trying to solve and plans for the future.","category":null,"speakers":[{"FullName":"Stefano Le Pera","Company":"The Times","Biography":"As an Engineering Manager at The Times, I oversee and manage all engineering teams in Times Media, across three different domains: web, mobile, and platform. With over 18 years of experience in the tech industry, I have developed and implemented career development plans, revamped the interview process, and provided regular feedback and coaching to engineers, helping them grow their skills and careers.\n\nI am also passionate about the community aspect in tech and actively involved in several initiatives that aim to empower and inspire diverse and inclusive audiences. I am the Lead Organizer of GDG Cloud London, one of the most active Google Developer Groups in Europe, where I host events, workshops, and talks on cloud technologies and best practices. I am also the Founder and Mentor of GDG Academy, a mentorship program that pairs university students from prestigious institutions with experienced mentors in the tech industry, and offers them internship opportunities. Additionally, I am a Google Women TechMakers Ambassador, promoting women's representation and participation in tech.","JobTitle":"Engineering Manager","PhotoFileName":"new-main-orange.png"}]},{"title":"Happy Healthy Team","description":"I have been working in web development for 13 years. I worked as a single developer, as a team member, team leader, and as a manager who is responsible for the success of the project.\nQuite often, Frontend work is the final step before the releases.\nHow not to go crazy when you have just 2 weeks before the release, and the design is not yet fully ready?\nWhat to do if you have a new technology stack and the team has not already handled it? What if the important developers leave the team before the release?\nLet’s talk about how to build processes in a team to have a self-managing team with a healthy environment.\nAt some point, each of us realizes that our job is not only moving Jira tickets. :)","category":null,"speakers":[{"FullName":"Vasilika Klimova","Company":"Kadena","Biography":"I have been a Web Developer for over 13 years (Frontend mostly, but also Fullstack).\u2028I had experience working as a single web developer, as a member of big teams in FinTech, and as a Team Lead of a small team.\nAlso, I am a Google Developer Expert and Women Techmaker Ambassador. I speak at Conferences and organize the LuxembourgJS community.\nThis year, I started to work as a Developer Relations Engineer at Kadena.io.\n\nMy passion is 🎮 video\/board games, 🏞️ traveling, 🤿 diving, animals (I have a red cat 🐈), and cinema 🎥. I collect children's books from different countries and Christmas tree decorations.","JobTitle":"Developer Relations Engineer","PhotoFileName":"1305206999_129446583166138_4561772950180516690_n-gde-badge-%281.png"}]},{"title":"How to approach AI and gain a competitive edge within the Media and Entertainment Industry","description":"In the context of the media and entertainment industry, spanning from data analytics tools to machine learning capabilities and generative AI platforms, there is an ongoing exploration of innovative AI applications within the OTT (Over-The-Top, streaming media) sector.\nWithin this presentation, we will thoroughly examine the domains where businesses discern the highest potential value derived from AI, the ongoing experimental initiatives, as well as the misconceptions requiring clarification.\nMoreover, I will expound upon the approach adopted towards AI, illuminate the identified use cases, and provide insights into the anticipated trajectory of this technology within the industry.","category":null,"speakers":[{"FullName":"Deepali Narsiker","Company":"Consultant ","Biography":"Deepali is a dedicated and highly accomplished media professional with over two decades of extensive experience in the TMT (Technology\/Media\/Telco) sector. In her most recent role, she held a pivotal position at a company that played a critical role in delivering AI-powered live TV, VOD, and OTT content across various platforms.\nPrior to that, she contributed her expertise to SingTel Telecommunications' premium OTT platform, HOOQ, which operated as a joint venture between SingTel Telecommunications, Warner Brothers, and Sony Entertainment. Her ability to work seamlessly with companies of varying sizes in organizing content, metadata, and distribution deals is particularly noteworthy. Her approach facilitates rapid business growth through a comprehensive global strategy.","JobTitle":"Consultant ","PhotoFileName":"deepali-narsiker.jpg"}]},{"title":"How to create a modern gallery with optimal performance and SSR.","description":"In this report, we will discuss the steps for creating a modern gallery that has a completely different layout on desktop and mobile, how to make it responsive, and ensure it works well on SSR (Server-Side Rendering). Afterward, we will go into web vitals metrics and what you should be concerned about in this regard. Furthermore, we will examine AB testing, compare it with the previous gallery, and discuss development time.","category":null,"speakers":[{"FullName":"Elena Litvinova","Company":"Loveholidays","Biography":"Qualified web engineer with more than 12 years of experience in the field. Now I live and works as a Software Engineer at Loveholidays (London). The founder of WebElArt community where I make training YouTube videos about web development in Russian (@webelart) and English (@webelart_en). Participated and implemented projects working for leading Russian IT companies such as Yandex and Artec3D. Also worked extensively with the frontend at Astroshock animation company and before that at the Tver State University. I am passionate about psychology.","JobTitle":"Software Engineer","PhotoFileName":"2023-10-03-10.29.57.jpg"}]},{"title":"Implementing Android Application with multiple entry points","description":"This workshop is dedicated to implementation of Android version of Flutter application, to be used for a specific purpose , where multiple entry points needed to the same app.\nThis feature can be used to isolate separate functionality in a scope of entry point.","category":null,"speakers":[{"FullName":"Vadym Pinchuk","Company":"Labrys","Biography":"Greetings to the mobile community! I am a passionate mobile Software Engineer with Ukrainian origins, currently residing in London, UK. My journey commenced as an Android Developer in early 2012, and in 2018, I became an active member of the Flutter community.\nDuring last two years I worked as an Android Developer at Instagram, but now returned back to the tech stack I love as a Flutter Developer at Labrys.","JobTitle":"Senior Software Engineer","PhotoFileName":"9134717.jpeg"}]},{"title":"Implementing object detection on live image streams in Flutter with TFLite","description":"At this workshop we will practically implement machine learning (ML) models application on live image streams using the Flutter framework. We will delve into the existing solution with the TensorFlowLite (TFLite) plugin.\nDuring 1 hour, we will start from the basic application with camera, and will add needed functionality on top, for image transformation, object detection and results displaying on the screen. Furthermore we will move heavy parts to the background isolate, with explanation why it should be done that way.","category":null,"speakers":[{"FullName":"Vadym Pinchuk","Company":"Labrys","Biography":"Greetings to the mobile community! I am a passionate mobile Software Engineer with Ukrainian origins, currently residing in London, UK. My journey commenced as an Android Developer in early 2012, and in 2018, I became an active member of the Flutter community.\nDuring last two years I worked as an Android Developer at Instagram, but now returned back to the tech stack I love as a Flutter Developer at Labrys.","JobTitle":"Senior Software Engineer","PhotoFileName":"pictures_london2023-3.jpg"}]},{"title":"Improvised Live Coding","description":"Have you ever been to an improv show before? If the answer is no, you should probably join us! We will create a Web App from scratch by collecting input from the audience. Everything is coded on the spot. You will learn the best tips for creating a Web App real fast, all while having a lot of fun!","category":null,"speakers":[{"FullName":"Juan Herrera","Company":null,"Biography":"Juan is a Google Developer Expert in Web Technologies and Angular. He's based in Graz, Austria, where he works as a software engineer for Viable. He is passionate about crafting apps, and he's currently building a different app every month. In his spare time, he does improv theater and dances.","JobTitle":"Google Developer Expert in Web Tech and Angular","PhotoFileName":"polish_20230107_121243283-%283.jpg"}]},{"title":"Intelligent Experiences: AI Integration in Modern Applications","description":"In the rapidly evolving landscape of modern applications, the integration of artificial intelligence (AI) has become a game-changer, ushering in a new era of intelligent and personalized experiences. This talk delves into the fascinating world of AI integration in modern applications, specifically using the powerful Google Palm API and the versatile Flutter framework.\n\nJoin us as we explore the boundless possibilities of harnessing AI's potential to revolutionize user interactions and drive user engagement. We will dive into the capabilities of the Google Palm API, which offers cutting-edge natural language processing and machine learning functionalities. Discover how to seamlessly integrate the Palm API with Flutter, empowering developers to build smarter and more dynamic applications.\n\nThroughout the session, we will showcase practical examples of AI-powered Flutter apps, where the Palm API brings unparalleled language understanding and cognitive capabilities to the forefront. From intelligent chatbots and voice-enabled assistants to advanced sentiment analysis and content recommendations, the potential of AI in modern applications is limitless.","category":null,"speakers":[{"FullName":"Aseem Wangoo","Company":"ShopBack","Biography":"This is Aseem Wangoo, founder of Flatteredwithflutter, tech event speaker, content creator, Google Dev Library Contributor, and technical writer. \nCurrently working with SouthEast Asia's largest online loyalty platform, ShopBack\n\nRanked in the Top 30 best flutter blogs. Speaker at Google Singapore and tech events (eg Flutter Meetups etc). Invited as a speaker to FlutterCon Berlin, Geekle, DartUp and other tech communities.\n","JobTitle":"Senior Software Engineer","PhotoFileName":"1678000225676-%281.jpeg"}]},{"title":"Into The Metaverse","description":"After winning the hackathon by Colorintech by developing a business product in the Metaverse, I have the pleasure to present about the Metaverse and the idea I won with: Fluency.\n\nFluency is the Mixed Reality solution to make you become fluent in a language through immersive experience in a foreign country. The best way to learn a language is to be fully immersed in the environment where that language is spoken. That’s why it’s been a common belief that in order to fully learn a language you have to live or spend an extensive amount of time in the country where that language is spoken. Moving abroad can be very expensive and not everyone has the opportunity to spend a significant amount of time away to learn a new language. That’s where this metaverse product Fluency comes into place. It allows users to be fully immersed in the environment where that language is spoken, closely replicating the life they are living in a parallel metaverse world in another country and language. The purpose of the product is to target students having a medium level of knowledge of a language and make them become fluent in an immersive world of natives, as if they were on an exchange year. \n\nThe product is currently under prototype development, as I am in the process of getting my MetaQuest 2 from Meta to develop directly with the VR set. I hope to receive my MetaQuest 2 well before the day of the devfest so I can apply my prototypes into the product and let the audience experience it. \n\nPlease note: depending on when I get the MetaQuest I might change the description and title of the talk. The focus of the talk will still be The Metaverse","category":null,"speakers":[{"FullName":"Marzia Deodato","Company":"Barclays","Biography":"Originally from Italy, I am the first generation in my family to go to University. Since I was kid, I excelled at school and my family supported me to continue my studies. I moved to Scotland to study at the University of Glasgow. I started my studies in Business & Economics and soon realised I wanted to engage in a more technical field. I learnt on my own how to code and changed my degree into Computing Science. I am working now as a Software Developer. My technology skillset goes from web development, mobile development to data science, Big Data and the Cloud. I love getting involved in technology related events and finding out about the latest trends. I am an organiser at Google's Developers Group Glasgow and Google's Women Techmakers Scotland. I am a #IamRemarkable Workshop facilitator and I am passionate about career development and helping women in technology thrive in their journey. I am part of the Women in Technology Committee at Barclays, I organise events to empower women in the workplace and young students. I am mentoring a student in her career into tech. My motto is \"Embrace the Enormity of the Possible\". I love to inspire others in embracing opportunities you would have never thought of before.","JobTitle":"Software Engineer","PhotoFileName":"img_1361_1.jpg"}]},{"title":"Introduction to Game Development with Flutter and Flame","description":"This session will be purely based on Game Development in Flutter with help of Flutter. \nI will start with a basic introduction to the Flame engine and some of the concepts of Game Development like Folder Structure, Game Loop, Collision Detection, adding objects, and giving a piece of awesome music to our game. \n\nIt will be a Shooting game or a Platformer game, but it will cover introductory to intermediate topics of Game Development in Flutter with Flame Engine. \n\nThis will really help users to explore the Game Development sector of Flutter and Flame.","category":null,"speakers":[{"FullName":"Shrihriday  Bhagwat","Company":"CODEAAMY PRIVATE LIMITED","Biography":"Founder Codeaamy Pvt Ltd - App Development Company \nLead Mentor and Video Course Creator at Kodeco\nVideo Course Creator at DroidCon \nYoutuber, Blogger, Corporate Trainer","JobTitle":"CEO \/ Founder","PhotoFileName":"shree_bhagwat_pp_round_border.png"}]},{"title":"Jetpack Glance - Android - Jetpack Compose","description":"Jetpack Glance is a robust framework, strategically constructed atop the Jetpack Compose runtime, designed for the seamless development and design of app widgets through the use of Kotlin APIs. App widgets, the miniature application views, serve as versatile components that can be effortlessly integrated into other applications, and they are capable of receiving periodic updates. This framework empowers developers to create dynamic and engaging widget experiences, ensuring that your app's interface remains vibrant and up-to-date.","category":null,"speakers":[{"FullName":"Reena Rote","Company":"University Of Mumbai","Biography":"I am a seasoned Android developer with a rich background of 9+ years in the field. Currently, I am actively contributing my expertise as a member of the dynamic team at JP Morgan and Chase. My passion for crafting innovative mobile solutions and my extensive experience make me a valuable asset in delivering cutting-edge Android applications that meet the highest standards of quality and functionality.","JobTitle":"Software Engineer III","PhotoFileName":"img_20230603_191602_380.jpg"}]},{"title":"Jumpstart Your Journey: A Beginner's Guide to Navigating Hackathons","description":"Stepping into the hackathon arena can initially feel overwhelming. I remember the uncertainties and questions I had when I began. But through persistence and learning, I managed to transition from a novice to clinching victories at elite events like Hack Harvard’21,Yale Hacks'22 and JP Morgan Chase and Co. annual hackathon - Code for Good which landed me an internship opportunity at JPMC. In this talk, I'll share my personal journey, the challenges I faced, strategies I adopted, and the lessons I learned along the way. Whether you're curious about where to begin or how to elevate your hackathon game, join me as I unveil the roadmap that guided my path to success.","category":null,"speakers":[{"FullName":"Abhishree Verma","Company":"Indira Gandhi Delhi Technical University For Women","Biography":"I'm Abhishree Verma, a passionate BTech student from Indira Gandhi Delhi Technical University for Women. My journey at JP Morgan Chase & Co. transformed me from a keen learner to a seasoned professional, mastering tools like Jira and diving deep into Agile practices. Beyond the corporate world, my proudest moments include clinching victories at hackathons, especially the prestigious Hack Harvard’21. I'm not just about codes and algorithms; I'm deeply committed to making STEM more inclusive. Having mentored over 200 girls, inspiring them to explore STEM fields, I believe in blending technical expertise with a purpose. My goal? To innovate, inspire, and make a difference.","JobTitle":"Student","PhotoFileName":"decent-picture.png"}]},{"title":"Krakend: One Gateway to Rule Them All","description":"In the ever-evolving landscape of modern software development and microservices architecture, efficient API management is a pivotal element for success. Krakend, an open-source API Gateway, has emerged as a powerful solution for simplifying the complexities of API management, routing, and composition. This presentation explores the primary features of Krakend and how it has the potential to enable organizations to construct resilient and expandable microservices-driven applications.\n\nThe session will begin by presenting a set of challenges and complexities that organizations face when managing multiple APIs separately and how Krakend can be the ultimate solution for these challenges. We will introduce Krakend's foundational components, which encompass API aggregation, transformation, filtering, decoding, throttling, authentication, and more. As the presentation progresses, participants will gain insights into Krakend's versatility and capabilities.\n\nFurthermore, we will conduct a live demonstration showcasing some of the key functionalities provided by Krakend and illustrating how third-party services such as Grafana, Kibana, and Jaeger interact with Krakend.\n\nBy the end of this presentation, participants will have a clear understanding of how Krakend can simplify API management, enhance security, and improve the overall efficiency of microservices architectures. Whether you are a developer, architect, or DevOps engineer, this session will equip you with the knowledge and insights needed to harness the full potential of Krakend in your projects.","category":null,"speakers":[{"FullName":"Octavio Antonelli","Company":"Golden Charter","Biography":"Senior Software Engineer at Golden Charter with over 15 years of experience, specializing in developing robust backend solutions and seamless API integrations.","JobTitle":"Senior Software Engineer","PhotoFileName":"img-4972-old-%281.jpg"}]},{"title":"Langchain zero shot fired - Let AI agents interact with your APIs using plain English","description":"Query your APIs and DBs with natural language, in English!\nIn this session, let's harness OpenAI API and GPT and AI autonomous agents 🤖 to unleash the power of your APIs and databases, and perform complex tasks that require agent to reason.\n\nUsing Langchain 🦜🔗 with Python 🐍, I'll will demonstrate how, using natural language, you can quickly and simply expose and interact with your APIs and DBs.\nLet's take a leap into the future 🔮 of API interaction and provide users with a dynamic, 🗣️ natural language interface that offers boundless possibilities!","category":null,"speakers":[{"FullName":"Charles-Philippe Bernard","Company":"JP Morgan Chase","Biography":"Hi, I'm Charles-Philippe Bernard, a tech enthusiast passionate with helping others growing their programming skills. 👩‍💻👨‍💻\nAs a Senior Manager of Software Engineering at JPMorgan Chase, I am leading a talented team of software professionals in Glasgow and Buenos Aires. With over 18 years of experience, I'm currently focusing on the integration of LLM and GPT 🤖 and driving a UX\/UI strategy 🖥️ for a group of 200+ people across the world.\nI just love diving deep into the latest tech trends, AI\/ML, VR\/AR, and UX\/UI, and believe they are the present and future of digital interaction. 🔮\nI'm excited to be able to share my insights and knowledge at Devfest.","JobTitle":"Senior Manager of Software Engineering","PhotoFileName":"1687899238383.jpeg"}]},{"title":"Leveraging Custom Machine Learning Models to level up Flutter Apps","description":"This talk explores the transformative potential of on-device machine learning. Learn to create, optimize, and convert custom machine learning models into efficient TensorFlow Lite (TFLite) format. Discover the seamless integration of these models into your Flutter apps using the TensorFlow Lite plugin, enabling real-time, on-device machine learning. Whether it's image recognition, natural language processing, or other AI-driven capabilities, this talk empowers you to elevate your mobile apps. Join us to embrace a new era of innovation and deliver exceptional user experiences with custom ML models in the world of Flutter development.","category":null,"speakers":[{"FullName":"Akanksha Singh","Company":"JP Morgan Chase & Co.","Biography":"Akanksha is a Software Engineer at JP Morgan Chase & Co., crafting engaging and innovative software solutions in the Asset and Wealth Management Line of Business. She has a keen interest in Flutter and enjoys building user-friendly and accessible applications. Her passion for Flutter has taken her to international conferences like FlutterHeroes, FlutterCon, and Flutter & Friends where she has shared her insights and expertise.\n\nBeyond her role, Akanksha is an avid participant in hackathons. Her passion for community building and mentorship has driven her to lead student communities at university and mentoring roles at prestigious hackathons like HackHarvard, Hack4Inclusion, HackTheNorth, DubHacks, CalHacks, and more.\n\nWhen she steps away from her keyboard, Akanksha finds solace in the timeless melodies of 60s-70s Hindi songs. She's an avid museum-goer, ignited by a deep passion for delving into art and history.","JobTitle":"Software Engineer","PhotoFileName":"acs_0186-%281.jpg"}]},{"title":"Leveraging Cypress for Effective API Testing","description":"This session will delve into the capabilities of Cypress, a powerful JavaScript-based testing framework for web applications, specifically focusing on its potential for API automation.\nIn today's dynamic and fast-paced digital landscape, testing the functionality and performance of your web application's UI and APIs is of paramount importance. Cypress simplifies this process by providing developers and testers with a user-friendly platform to write end-to-end tests. Beyond UI testing, Cypress excels in its ability to handle API testing, making it an invaluable tool for comprehensive test coverage.\nDuring this presentation, we will explore the fundamental concepts of Cypress and showcase its exceptional capabilities in API automation.","category":null,"speakers":[{"FullName":"PETROS PLAKOGIANNIS","Company":"Trasys Greece","Biography":"Petros Plakogiannis has graduated the University of Piraeus and the Technological Educational Institute of Crete. He has been working professionally as a software tester for 15 years, with strong focus on automated testing using various tools like QTP, Selenium and Cypress. He also has a significant experience in white box testing, application testing and security testing. Petros is Cypress ambassador and also the main organizer of the Ministry of Testing Athens meetups.","JobTitle":"Test Team Leader","PhotoFileName":"me-2_00x.jpg"}]},{"title":"Make accessible Forms","description":"In our 30-minute tech talk, \"Make Accessible Forms,\" we will dive into the practical aspects of designing accessible online forms. We'll start with an understanding of web accessibility principles and why they matter. Then, we'll explore the benefits of accessible forms, such as enhanced user experiences and legal compliance.\n\nThe heart of the talk focuses on the \"how.\" We'll delve into key accessibility principles, including perceivability, operability, understandability, and robustness. You'll learn hands-on techniques for structuring forms, labeling elements, providing input assistance, and leveraging semantic HTML and ARIA roles.\n\nWe'll also discuss testing and validation methods, showcasing real-world case studies to illustrate successful implementation. By the end, you'll leave with actionable insights and best practices to make your forms truly accessible","category":null,"speakers":[{"FullName":"Neha Sharma","Company":null,"Biography":"Hello, I am an experienced front-end developer. I enjoy writing tech blogs, and videos, and organizing meetups. I am the founder of the JSLovers meetup community in India. I am an advocate for web accessibility. When I am not coding, I do calligraphy.","JobTitle":"Principal Engineer","PhotoFileName":"neha-dp.jpg"}]},{"title":"Make your application serverless","description":"This is an introductory session of building a serverless application, I’ll focus on its use cases, benefits as well as the cloud technologies available on the market.","category":null,"speakers":[{"FullName":"Elliott Lyu","Company":"Barclays","Biography":"I’m a tech enthusiast with a finance background, currently working as a software developer at Barclays. My experience ranges from full stack development in various languages to cloud engineering.","JobTitle":"Software Developer","PhotoFileName":"img_9172.jpeg"}]},{"title":"Mastering Flutter App Navigation: A Deep Dive into Navigator 2.0","description":"In this session, I'll cover the following topics:\n\n- The key difference between Navigator 1.0 and 2.0\n- Need of Navigator 2.0 and why should you upgrade to Navigator 2.0\n- How can we use Auto Route to simplify navigation using Navigator 2.0\n- Advanced functionalities of Auto route like: Route Guards, Declarative routing, Nested Navigation","category":null,"speakers":[{"FullName":"Cavin Macwan","Company":"Sardar Patel University","Biography":"My name is Cavin Macwan and I am Flutter Developer at 7Span.\n\nI enjoy sharing my insights on Flutter and Mobile Development by writing articles on Medium and by speaking at various Flutter events. Apart from coding, I like to play basketball and participate in hackathons. You can check my articles with the link below :\nLink: https:\/\/medium.com\/@CavinMac\n","JobTitle":"Flutter Developer","PhotoFileName":"cavin_profile.jpg"}]},{"title":"Maximizing BigQuery's Potential: Boosting Performance, Cutting Costs, Powering Your Data Platform","description":"Do you want to supercharge your data platform's performance and cost-efficiency? This session delves into the secrets of optimizing BigQuery for peak performance and cost savings. Discover how to fine-tune BigQuery alongside the essential data ingestion, processing, and consumption services that will take your platform to the next level. Get ready to uncover the keys to a high-performance, cost-effective data solution that can transform your data-driven capabilities. Don't miss out—your data platform's future success awaits!","category":null,"speakers":[{"FullName":"Vasudev Maduri","Company":"Admiral Group","Biography":"Vasudev is a seasoned professional currently serving as a Staff Data Engineer at Admiral Group. With a wealth of experience in the realms of Google Cloud Platform (GCP), big data, and data architectures, Vasudev has consistently demonstrated his prowess in implementing industry-leading products recognized by Gartner.\n\nHis journey in the world of technology has encompassed stints at renowned organizations like Hitachi and Ford, where he honed his expertise in data engineering and analysis. Vasudev is not only a practitioner but also an active mentor, deeply committed to fostering talent and contributing to open-source technologies.\n\nAs a thought leader in his field, Vasudev has shared his insights and knowledge with a global audience through over 30 impactful talks. Vasudev continues to inspire and innovate, driving transformative change in the world of data and technology.","JobTitle":"Staff Data Engineer","PhotoFileName":"vasupp_400_400.jpg"},{"FullName":"Vasudev Maduri","Company":"Admiral Group","Biography":"Vasudev is a seasoned professional serving as a Staff Data Engineer at Admiral Group. With a wealth of experience in the realms of Google Cloud Platform (GCP), big data, and data architecture, Vasudev has consistently demonstrated his prowess in implementing industry-leading products recognized by Gartner.\n\nHis journey in the world of technology has encompassed stints at renowned organizations like Hitachi and Ford, where he honed his expertise in data engineering and analysis. Vasudev is a practitioner and an active mentor, deeply committed to fostering talent and contributing to open-source technologies.\n\nAs a thought leader in his field, Vasudev has shared his insights and knowledge with a global audience through over 30 impactful talks. Vasudev continues to inspire and innovate, driving transformative change in the world of data and technology.","JobTitle":"Staff Data Engineer","PhotoFileName":"safeimagekit-vasu_1000_100.png"}]},{"title":"My Journey Into Open Source (and how I oversee 250 repositories!)","description":"Interested in contributing to Open Source Software? Join me as I share my experience of diving into the open-source community.\n\nI'll be speaking about my early contributions, some of the challenges that I've faced and finally, share insights on my position as a core maintainer overseeing and contributing to \"Catppuccin\" - a large open source organization.","category":null,"speakers":[{"FullName":"Goudham Suresh","Company":"BBC & University of Glasgow","Biography":"Goudham is a final-year graduate apprentice, pursuing a BSc in Software Engineering at the University of Glasgow while working as a software engineer at the BBC. The apprenticeship has allowed him to bridge the gap between theory and practice in a way that few students can claim. He applies his academic knowledge at the BBC and, in turn, uses practical insights gained there to enhance his academic studies. In addition to his academic and professional pursuits, Goudham is a passionate open-source advocate who firmly believes in the power of collaboration within the open-source community.","JobTitle":"Software Engineer Apprentice","PhotoFileName":"goudham_bbc_photoshoot.jpeg"}]},{"title":"New features in Dart 3","description":"In this talk, we will see some of the new features in Dart 3. Dart 3 isn’t just about changing the existing language. It’s also about adding significant new features and capabilities! These include records, patterns, and class modifiers. Many of these features allow Dart developers to write more functional style code in a language that’s traditionally object oriented. Dart 3 are useful for all Flutter developers, but it can be hard to understand just how useful they are. The information in this talk is valuable to every single Flutter developer, regardless of experience level.","category":null,"speakers":[{"FullName":"Yogita Kumar","Company":null,"Biography":"Yogita Kumar, GDE for Flutter and Women Techmakers Ambassador, she is a Mobile app developer based in London, UK, having 12+ years of professional experience. She enjoys creating Mobile applications in Flutter, including backend services and integration with external systems. In her free time, she enjoys writing tech blogs on medium. She loves to play with her kids. In free time you see her solving a jigsaw puzzle with them.\n\nYou can connect with her on\nLinkedIn : https:\/\/www.linkedin.com\/in\/yogitakumar05\nTwitter :  https:\/\/www.twitter.com\/yogitakumar05\nMedium : https:\/\/medium.com\/@helloyogita","JobTitle":null,"PhotoFileName":"yk.jpeg"}]},{"title":"Our future without passwords","description":"Picture the future. What do you see? Flying cars? Vacations in space? How about…not needing to remember passwords anymore? Well, welcome to that future (the no passwords one, not the flying cars).\n\nPasskeys are here to make our digital lives easier and more secure–they cannot be reused, don't leak in server breaches, and protect users from phishing attacks. I’ll take you on a journey through our future where you can log in to a site or an app by unlocking your phone and show you how authentication systems with passkeys work.","category":null,"speakers":[{"FullName":"Milica Mihajlija","Company":"Google","Biography":"Milica is a technical writer at Google working on privacy and identity. She is a big believer in the open web, always exploring new technologies that are moving it forward.","JobTitle":"Technical Writer, Chrome","PhotoFileName":"unnamed.jpg"}]},{"title":"Overcoming Anxiety As An Open Source Contributor (Beginner's Guide)","description":"My Journey And Simple Ways you can take off anxiety as an open source freshman","category":null,"speakers":[{"FullName":"Ogechukwu Aina","Company":"African Development Bank","Biography":"My name is Ogechukwu Itunu Aina from Lagos, Nigeria. A Jnr Frontend Developer with professional experience in Product Development, skills in ReactJs,  JavaScript, technical Writing and Open Source","JobTitle":"Software Developer Intern","PhotoFileName":"img_20210809_122937_476~3.jpg"}]},{"title":"Personalised Advertising in OTT with AI-driven ad Campaigns","description":"In this slide deck, I'll guide the audience through the exciting realm of personalised advertising on OTT platforms using AI-driven strategies. We'll explore the ins and outs of integrating ad servers seamlessly, crafting comprehensive user profiles, and implementing recommendation algorithms for dynamic ad insertion based on individual preferences. Technology-wise, I will dive into recommendation algorithms, data privacy and dynamic ad insertion practices.","category":null,"speakers":[{"FullName":"Deepali Narsiker","Company":"Consultant ","Biography":"Deepali is a dedicated and highly accomplished media professional with over two decades of extensive experience in the TMT (Technology\/Media\/Telco) sector. In her most recent role, she held a pivotal position at a company that played a critical role in delivering AI-powered live TV, VOD, and OTT content across various platforms.\nPrior to that, she contributed her expertise to SingTel Telecommunications' premium OTT platform, HOOQ, which operated as a joint venture between SingTel Telecommunications, Warner Brothers, and Sony Entertainment. Her ability to work seamlessly with companies of varying sizes in organizing content, metadata, and distribution deals is particularly noteworthy. Her approach facilitates rapid business growth through a comprehensive global strategy.","JobTitle":"Consultant ","PhotoFileName":"deepali-narsiker.jpg"}]},{"title":"Potential of opensource LLM - H2OGPT \/ Offline alternative for ChatGPT","description":"h2oGPT is one of the first open sourced GPT models that allows you to ground an LLM by providing it with dynamic unstructured data, enabling it to respond based on your data and cite sources when necessary.\nUnlike ChatGPT , h2oGPT is completely free and simplifies the process of creating a private LLM .\nh2oGPT has the search web function which helps h2oGPT to browse internet to provide you with the best response for the prompts.\nIt can also be used offline and can be trained on our own data.\nH2O LLM Studio - a framework and no-code GUI for fine-tuning LLMs.","category":null,"speakers":[{"FullName":"Sudipto Ghosh","Company":"JPMorgan Chase & Co.","Biography":"Sudipto is a Software Engineer at JPMorgan Chase & Co. He enjoys working with various tools & technologies .\nIn his spare time he listens to and creates music. \n","JobTitle":"Software Engineer","PhotoFileName":"sg_dp.jpg"}]},{"title":"Product Management: Expectations vs Reality","description":"In today’s fast-paced and ever-evolving tech industry, the role of a Product Manager has become increasingly critical. However, there often exists a discrepancy between the expectations associated with the role and the reality that professionals encounter on a daily basis. This talk aims to bridge that gap by providing insights, practical knowledge, and valuable tips to be and work with Product Managers","category":null,"speakers":[{"FullName":"Giuseppe Di Biase","Company":"Personio HR","Biography":"I am a Product Manager with over 6 years of experience in Tech, specially FinTech and HR Tech. I have a degree in Mechanical Engineering and I am currently pursuing an online Masters in Computer and Information Technology. Currently, I live in Madrid, Spain where I have been focusing on building a payroll solution for European SMEs for the last year and getting more involved in the tech and product community of the city. Outside of work, I enjoy running, playing football, and reading.","JobTitle":"Product Manager","PhotoFileName":"copy-of-sua07850%281.jpg"}]},{"title":"Prompt Engineering with Vertex AI","description":"After the advent of ChatGPT ,one of the new engineering paradigm which was evolved is Prompt Engineering. To enable the audience on how to efficiently use the Generative AI applications , this talk is designed to cover the fundamentals of language models, providing the audience with a solid foundation and also dive deep into the specifics of crafting prompts that yield desired outputs and text generation to name a few. This talk will also provide an overview of different types of Prompt engineering and explore how to implement\/adopt Prompt Engineering with Vertex AI.","category":null,"speakers":[{"FullName":"Nishi Ajmera","Company":"Publicis Sapient","Biography":"Nishi Ajmera is a full stack developer who is passionate about emerging new technologies in the web development field. With a keen interest in web development, she has gained expertise in various programming languages, frameworks, and tools.\nApart from her professional expertise, Nishi is a public speaker and has delivered multiple sessions at various Google Developer group talks and Javascript meetups.\nWhen she's not coding or reading, Nishi can be found exploring new places and cuisines. She believes that traveling and trying new things is a great way to keep her mind fresh and inspired.","JobTitle":"Lead Engineer","PhotoFileName":"screenshot-2023-08-30-at-16.42.45.png"}]},{"title":"Responsible AI: Prioritising people, values, and ethics in a data-driven world","description":"Join me for a thought-provoking and engaging keynote that dives into the world of responsible AI. As artificial intelligence becomes increasingly intertwined with our daily lives, it's crucial to ensure that the algorithms powering these systems are developed with ethical considerations in mind. We will explore the challenges and opportunities in creating AI that respects human values, promotes fairness, and ensures transparency.","category":null,"speakers":[{"FullName":"Patty O'Callaghan","Company":"Charles River Laboratories","Biography":"Patty is a Venezuelan living in Scotland. She has +20 years of experience in the tech industry and a background education in Computer Science and Artificial Intelligence. She is a Tech Lead at Charles River Laboratories.\n\nIn her free time, Patty is a dedicated mentor and educator, leading a Code Club for 10-15 year-olds at her local school. Additionally, she's an organiser at Google Developers Group Glasgow, serves as an Ambassador for Google's Women Techmakers, and is recognised as a Google Developer Expert (GDE) in Machine Learning.\n\nShe is very passionate about AI and loves sharing her knowledge and expertise with others, frequently giving talks and technical workshops on various technologies and topics related to it, especially Web Machine Learning.","JobTitle":"Tech Lead","PhotoFileName":"profilepic.jpg"}]},{"title":"Revolutionizing Collaboration: AI and Architecture Decisions","description":"After this talk, attendees will gain a profound understanding of documented architecture decisions, avoiding anti-patterns, and fostering collaboration. They'll discover the transformative power of ADRs and AI, enabling effortless access to project details. With enhanced skills, they can drive efficiency, collaboration, and innovation, leading to improved outcomes in software engineering.","category":null,"speakers":[{"FullName":"Jose Calderon","Company":"JP Morgan & Chase","Biography":"Lead Software Engineer @ JP Morgan Chase, JAVA \/ Spring Community lead, Google Developer Group Organizer, Affiliate Professor @ Glasgow University","JobTitle":"Lead Software Engineer","PhotoFileName":"profile.jpeg"}]},{"title":"Set-up HA Kubernetes Cluster - the easy way with KubeOne","description":"Getting a Kubernetes Cluster Up and running can be painful, especially when you need to perform this on multiple environments. \nThere is an easy solution for this called KubeOne - this Open Source Cluster Lifecycle management Tool for High Available Kubernetes Cluster makes it easy to Set-Up and Update your Kubernetes Clusters easily.\nIn it's declarative style based on the Kubernetes Cluster API we will see how we can install, configure, extend and update your Kubernetes Cluster with KubeOne","category":null,"speakers":[{"FullName":"Mario Fahlandt","Company":"Kubermatic","Biography":"Mario is from a small village in Germany and working for Kubermatic. He studied creative media at an English university and moved his field of knowledge to Cloud Native Infrastructure. He is working as a Customer Delivery Architect with the focus on planning and building concepts and architecture for Infrastructure in the Cloud native world. He started the Google Developer Group for Cloud in Munich back in 2016 and became a Cloud Google Developer Expert in 2019. His passion is always to move the cloud native community one step forward.","JobTitle":"Customer Delivery Architect","PhotoFileName":"gde_bage_hochkant_small.png"}]},{"title":"Should you pay down technical debt?","description":"Learn what technical debt is, how it accrues, and how to pay it down.","category":null,"speakers":[{"FullName":"Arron Edwards","Company":null,"Biography":"I work with startups to help them scale up. Ex-company owner of 16 years, with distributed teams. I help engineers deliver software faster with less stress and drama.","JobTitle":null,"PhotoFileName":"img_2832.jpeg"}]},{"title":"Simple ML for Sheets Workshop","description":"In today's data-driven world, making sense of vast amounts of information is crucial. But what if you could harness the power of machine learning without the need for complex programming or specialized tools? Join us for an enlightening talk on \"Simple ML for Sheets,\" a game-changing solution that brings the world of machine learning directly into your Google Sheets.","category":null,"speakers":[{"FullName":"Roushanak Rahmat","Company":null,"Biography":"Roushanak is an Computer scientist Lecturer in London. \nPrior to this she was an AI Scientis at a world leading medical tech company, Elekta, Institute of Cancer Research, Cambridge Queens’ College, University of Cambridge, and St. Andrews University. \nShe obtained her PhD in AI at the school of Electrical, Electronics and Computer Engineering at Heriot-Watt University in collaboration with the University of Edinburgh. \nHer research interests are in the fields of medical image analysis and computer vision, where she is developing novel algorithms and models in deep learning to improve healthcare. These structured models allow modeling uncertainty and diversity, which enables novel applications of deep learning from personalization of products and therapies to decision making under uncertainty. \nShe believes AI would revolutionize healthcare and personalize medical treatment in the near future.","JobTitle":"Lecturer","PhotoFileName":"img-20231012-wa0005_0.jpg"}]},{"title":"Soft Skills for Developers","description":"While technical skills determine the development of your software product, its quality is often a result of how well your software development team works together. This session will therefore help developers know what skills they need and the\nSoft skills are evolving and changing that will make them future proof.\n\nBesides being a good coder\/developer\/programmer\/engineer, every developer needs soft skills in their toolbox.","category":null,"speakers":[{"FullName":"Sospeter Mongare","Company":"Xetova Limited","Biography":"Sospeter is an experienced, passionate and self-motivated Software Engineer specializing in web applications development and APIs, with a proven track record of designing, developing, and testing software systems. My journey in this dynamic industry has equipped me with a strong foundation in software development, software engineering, management information systems, and database administration.\n\nMy expertise lies in quickly mastering new skills, creative problem-solving, and employing domain-driven design principles to create responsive and optimized solutions for the web. I'm well-versed in Object-Oriented Principles and specialize in the Model View Controller (MVC) approach and other programming paradigm for organizing code.\n\nMy hands-on proficiency extends across a spectrum of technologies, including PHP, Python, SQL, JavaScript, Laravel, Django, Bootstrap, WordPress, jQuery, HTML5, CSS3, MySQL, PostgreSQL, Microsoft SQL (MSSQL), Database Administration. ","JobTitle":"Senior Software Engineer","PhotoFileName":"dsc_7001.jpg"}]},{"title":"Spaced repetition for engineers","description":"The talk would describe the value that spaced repetition can have for coders of all levels as it is a way to become long term learners rather than forgetting what we once learned only to have to relearn it at a later date when required again. The ability to actively recall information (without Google) that has not been used in months even years is a super power worth sharing. Particularly relevant in our field where syntax and pattern matching are of utter importance. ","category":null,"speakers":[{"FullName":"Carlos Perez","Company":"Arnold Clark","Biography":"Born and raised in Guayaquil, Ecuador. Studied Economics at undergraduate level and Business Analytics at postgraduate level both at the University of Edinburgh. Currently working as a Software Engineer at Arnold Clark.","JobTitle":"Associate Software Engineer","PhotoFileName":"photo-passport-_0.jpeg"}]},{"title":"Storytelling & Software Development","description":"Delving into the profound significance and indispensable role of storytelling for developers and decision-makers in the software development cycle. This exploration draws upon real-world case studies and offers practical tips to seamlessly integrate narrative elements into both projects and one's overarching career trajectory.\n","category":null,"speakers":[{"FullName":"Hope  Wilson","Company":"Pluralsight, ReDI, and Serverless Salad (Founder)","Biography":"Filmmaker, full stack developer, and founder with a passion for education and a keen interest in storytelling through data and digital media. Proud Google Women Techmakers Ambassador and Women Who Code (Cloud) Leadership Fellow.","JobTitle":"Instructor & Software Developer","PhotoFileName":"hope_profile-pic_copy_0.png"}]},{"title":"Supercharging Your Fitness with Wearables, Analytics, and the cloud with a pinch of PaLM","description":"In this talk learn how I turned my fitness journey into a data problem. We'll dive deep into my integration of Google Sheets, Google Maps, Pixel Watch, Fitbit data, and Google Cloud to create an easy fitness analytics dashboard in Google Sheets. Learn how I used wearable sensors to track critical metrics, harness analytics to learn insights that worked for me, and even implemented an AI to act as my personalized coach after I put all the weight I lost back on.  ","category":null,"speakers":[{"FullName":"Steven Gray","Company":"University College London","Biography":"Steven Gray is a Professor of Spatial Computation at UCL's Centre for Advanced Spatial Analysis, Director of UCL Digital Humanities & is a Fellow at the Alan Turing Institute (The UK's National Center for Data Science and AI) where he co-leads Turing's Tools, Practices and Systems programme. His research interests include large scale data collection and analysis, human computer interaction,  ubiquitous computing, and on-device machine learning for mobile systems.  Through his Software engineering outreach, he is a recognised Google Developer Expert for Google Cloud & Maps, Google Cloud Champion Innovator for Data Analytics, Modern Architecture & Machine Learning.","JobTitle":"Professor of Spatial Computation","PhotoFileName":"img_2923.jpg"}]},{"title":"Terraforming Cloud","description":"Introductory talk that unveils the power, the need, and the magic of Infrastructure-as-Code (IaC) with the game-changing tool: Terraform.\n\nIn this electrifying session, we're not just scratching the surface – we're diving headfirst into the core of modern DevOps. Imagine a world where infrastructure is no longer just a setup, but a piece of code that empowers your innovation and growth.\n\nAre you ready to embark on a journey that will redefine your approach to DevOps? Prepare to:\n- Uncover the unmatched demand for Infrastructure-as-Code in today's fast-paced tech landscape\n- Discover the transformative power of Terraform – the ultimate IaC wizardry at your fingertips\n- Learn how Infrastructure-as-Code reshapes the very fabric of DevOps, delivering agility, scalability, and efficiency\n- Dive into real-world examples that showcase the tangible benefits of embracing IaC with Terraform\n- Gain the insight and inspiration you need to start your own IaC journey and thrive in the DevOps era.","category":null,"speakers":[{"FullName":"Aniket Kumar Sinha","Company":"Rapid Circle","Biography":"Aniket, the Cloud Consultant at Rapid Circle! With an impressive track record of being 4x Microsoft Certified, Aniket thrives in the dynamic world of Azure and Terraform.\n\nAs a dedicated Cloud Consultant, Aniket's daily playground involves orchestrating the intricacies of Azure and harnessing the transformative power of Terraform. His expertise goes beyond just certificates – it's a result of his hands-on experience and an unquenchable curiosity for all things cloud.\n\nAniket's passion for community shines brightly through his involvement in esteemed groups like Microsoft Learn Student Ambassadors and Google Developer Student Club. He's not just about personal growth; he's all about creating a collective force of knowledge-sharing and exploration.\n\nEquipped with a blend of technical wizardry and a community-driven spirit, Aniket is more than a Cloud Consultant – he's a navigator, a collaborator, and a tech enthusiast on a mission to elevate the cloud experience for all.","JobTitle":"Cloud Consultant","PhotoFileName":"aniketkumarsinha.jpg"}]},{"title":"Text in Jetpack Compose","description":"In this talk we will explore how text is built in Jetpack Compose and cover some best practices for working with it.","category":null,"speakers":[{"FullName":"Anastasia Soboleva","Company":"Google","Biography":"I've been working on Jetpack Compose at Google for several years. Previously contributed to layouts, Material design components and accessibility, and currently I'm focused on text and text input.\n","JobTitle":"Software Engineer","PhotoFileName":"photo-conf.jpg"}]},{"title":"The GenAI Revolution in Further Education - Beyond Classroom Boundaries, a case study","description":"Dive into a real-world exploration of how one training company seamlessly integrated GenAI into their further education programme. This case study not only reveals the nuances of our transformative journey but also draws out universally applicable insights beneficial for any industry. Understand the strategies employed, the hurdles faced, and the astounding outcomes in terms of process efficiency and enriched training experiences. Whether you're from education, healthcare, finance, or any other sector, our tale of technological integration offers valuable lessons on embracing innovation, driving efficiency, and enhancing user experience. Come, extract actionable insights that can redefine processes in your own field.","category":null,"speakers":[{"FullName":"Lisa  Carpenter","Company":"Digital futures","Biography":"Lisa is the lead data science instructor at Digital Futures, with responsibility for the design of our Data Science programme and delivery of a world-class learning experience for our engineers. Lisa has over 12 years experience working in data teams. She has worked with organisations to deliver value from their data, building technical solutions and statistical models to produce actionable insight. In 2018, Lisa discovered her passion for developing individuals in data and begun developing and delivering data courses.\n\nLisa is passionate about empowering people through digital skills and is a firm believer than anyone can learn to use technology to enrich their processes and workflows. She believes in the importance of ethics in Data Science and that everyone has a duty to act within the best interest of humanity.\n\nOutside of work, she is an avid boulderer and is also often found meandering down Regent’s Canal on her paddleboard.","JobTitle":"Lead data science instructor","PhotoFileName":"1000017943.png"}]},{"title":"The Importance of Visibility as a Software Developer ","description":"In the realm of social media, the importance of visibility as a software developer cannot be overstated. In a digital landscape where competition is fierce, establishing a strong online presence is crucial for career growth and networking. Sharing your coding journey, projects, and insights not only showcases your expertise but also fosters connections within the developer community. Visibility on platforms like LinkedIn, GitHub, or Twitter can lead to collaboration opportunities, job offers, and knowledge exchange. Moreover, it allows you to stay updated on industry trends and emerging technologies. In a world driven by technology, being visible as a software developer is synonymous with staying relevant and impactful.","category":null,"speakers":[{"FullName":"Oluwatoni  Ogunfusika ","Company":null,"Biography":"I am a software developer with over 3 years of experience in C# and .NET core development. I am also skilled in Angular and have experience with DevOps using Microsoft Azure. My passion for software development has driven me to continuously learn and improve my skills in these areas.\n\n I have worked on various projects, from building web applications to creating APIs, and I am always eager to take on new challenges. My expertise in C# and .NET core allows me to create robust and efficient code, while my experience in Angular enables me to design responsive and user-friendly front-end interfaces. \n\nAdditionally, my familiarity with DevOps using Microsoft Azure has given me the skills necessary to manage and deploy applications with ease. I am a team player who values communication and collaboration, and I always strive to deliver high-quality work on time.","JobTitle":null,"PhotoFileName":"img-20230814-wa0018.jpg"}]},{"title":"The Rollercoaster of building an App with ChatGPT","description":"Join us for a journey of using ChatGPT to construct a language-learning app. While one might assume that this endeavor would be straightforward, in reality, we found it to be more complex than anticipated. We encountered challenges spanning from cyber attacks to professional scam attempts. Make sure you listen to this exciting story. You'll be better prepared.","category":null,"speakers":[{"FullName":"Juan Herrera","Company":null,"Biography":"Juan is a Google Developer Expert in Web Technologies and Angular. He's based in Graz, Austria, where he works as a software engineer for Viable. He is passionate about crafting apps, and he's currently building a different app every month. In his spare time, he does improv theater and dances.","JobTitle":"Google Developer Expert in Web Tech and Angular","PhotoFileName":"polish_20230107_121243283-%283.jpg"}]},{"title":"The Web in 2023: How Far We've Come","description":"In the ever-evolving landscape of web development, we have witnessed a remarkable transformation in the capabilities of web browsers over the years. Gone are the days when we relied on a multitude of browser extensions like Flash or ActiveX to provide app-like functionality. Similarly, we don't have to rely so much on libraries like jQuery to provide cross-browser compatibility, and we have browser standards to thank!\n\nFortunately, the era of plugins and compatibility libraries is behind us. Nowadays we have a treasure trove of cross-browser APIs that give us the functionality we need to build incredible immersive websites and applications. As well as compatibility, the rise of Progressive Web App technologies like the manifest file and Service Worker has enabled us to build native app-like experiences on the web, with companies like Starbucks and Pinterest using them to provide their customers with features like add to homescreen and offline caching. This parity with native has been pushed even further by initiatives like Project Fugu allowing us to truly rival even native applications, with all the security, reach and ease of access of the web. We can see apps being able to do things like access the native file system, wake lock your device and easily share to socials. In the gaming and immersive tools space we see technologies like WebAssembly enable companies like Unity, Figma and AutoDesk to take their applications and web offerings to the next level. \n\nEverywhere we look new browser standards and technologies have, and continue to, push the boundaries of what's possible on the web all with the distribution and reach that we all know and love. This talk will be an overview of how the web has evolved and how we can leverage its capabilities today to build incredible applications. Attendees can expect to come away primed knowing what tools are available to them and where to look to learn more about these technologies. ","category":null,"speakers":[{"FullName":"James Milner","Company":null,"Biography":"James is a experienced web developer, having been building on the platform for over ten years. He currently lives in London, working remotely for NearForm, a web application consultancy with a strong history in the open source world. He has been a Google Developer Expert for Web Technologies for over 5 years, having spoken at events around the globe during this time and mentored at programs like Women Developer Academy and Road to GDE. His specific areas of interest are JavaScript\/TypeScript, geospatial, and pushing the web platform forward. ","JobTitle":"Senior Software Developer","PhotoFileName":"headshot.jpeg"}]},{"title":"The future of UI is \"open\"","description":"When dealing with more advanced UI elements there are a lot of things that go wrong. They impact performance, accessibility and have the tendency to create frustrations along the way. In this talk, I will be introducing you to the W3C community around Open UI and showing you the in and outs of popovers, selectlist and accordeons with pure HTML. We will also taking a little detour with the Anchoring API. By combining these future specs we'll take a peek at the future of styling custom UI by only using HTML and CSS, giving you less frustration, performance boosts and basic accessibility out of the box.","category":null,"speakers":[{"FullName":"Brecht De Ruyte","Company":"iO","Biography":"I'm a self-taught front-end developer located in Belgium with a passion for UX and Design. After more than a decade working in tech, I decided to start a little blog for documenting my findings about HTML, CSS and JS with an eye on accessibility and UX. Because of that, I started writing for Smashing Magazine, CSS-tricks and since recently became a Google Developer Expert.\n\nDuring the day, you can find me working at iO on a variety of projects. There are a lot of environments I'm working in, the majority of them being Twig or React. But my real niche will always be semantics and CSS, especially now, with the ever fast updates in browser support. It's a great time to be a front-end developer.","JobTitle":"Front-end Developer","PhotoFileName":"brecht.jpg"}]},{"title":"The secrets of building stunning UIs with paths & custom paint in Flutter:","description":"Flutter is a powerful framework for creating beautiful and responsive UIs for mobile, web, and desktop applications. One of the features that make Flutter stand out is the ability to use CustomPaint and Path to draw custom shapes and graphics on a canvas.\n\nMost of us would have come across with CustomPaint on our Flutter Journey, but very few of us understand how it works. And how to take UIs, graphics, and animations to next level.\n\nIn this talk, we will learn the secrets of building stunning UIs with paths and custom paint in Flutter. We will discover how to use the CustomPaint widget and the CustomPainter class to create our own painters that can draw anything one can imagine on a canvas. We will also learn how to use the Path class to create complex shapes and curves to enhance graphics. And not only that we will see how we will animate these paths on canvas in Flutter. By the end of this talk, you will have the skills and confidence to unleash your creativity with paths and custom paint in Flutter. Join me in this fun and interactive session where we will be playing with paths in Flutter!","category":null,"speakers":[{"FullName":"Divyanshu Bhargava","Company":"Securrency","Biography":"Divyanshu Bhargava is leading the mobile engineering at Securrency. He is a Google Developer Expert in Flutter & Dart and an Organizer of Flutter Abu Dhabi & Dubai. His passion for building apps took him to mobile development, these days you’ll find him talking about Flutter and the future of tech.  He is an open-source enthusiast and an avid tech blogger. When he is not coding you can find him kayaking, reading, traveling, or thinking about coding.","JobTitle":"Mobile Lead","PhotoFileName":"1665410419201.jpeg"}]},{"title":"Three factors that are blocking contributions to your Open Source project","description":"When talking about contributing to open-source projects, it’s crucial to understand from a maintainer point of view what factors are stopping new contributors from contributing to your project. Whether your codebase is very overwhelming to the contributors for the first time or it  lacks good first issues and enough responsive response to their problems. In this talk, I will explain how I built a campaign at Amplication that scaled the contributors from 30 to 200 in just one year and how it solved every problem I mentioned above.\n\n- Understanding the perspective of new contributors\n- Identifying factors that hinder new contributors from participating in open-source projects\n- Overwhelming codebase as a barrier for first-time contributors\n- Insufficient availability of beginner-friendly tasks (good first issues)\n- Lack of responsive support for addressing contributors' issues\n- Describing a successful campaign at Amplication\n- Achieving significant contributor growth (from 30 to 250+) within one year\n- Addressing and resolving the aforementioned obstacles through the campaign\n","category":null,"speakers":[{"FullName":"Saurav Jain","Company":"Amplication","Biography":"Saurav is an experienced Community Manager with a passion for open-source development. Over the past two years, he has been dedicated to fostering and growing a vibrant community of over 30,000 open-source developers. Saurav's expertise lies in running successful programs such as \"Issues for First Timers,\" which has facilitated the onboarding of hundreds of new developers into the world of open source.\n\nWith a strong online presence, Saurav has garnered a substantial following of over 40,000 on Twitter. He actively engages with the open-source community, sharing valuable insights, promoting collaboration, and advocating for the benefits of open-source software.\n\nSaurav's expertise in community management and his commitment to open-source development have earned him opportunities to speak at renowned conferences worldwide, including PyCon Ireland, PyCon Italy, FOSS Mumbai, OCD India, DevRel.com, and many more. As a speaker, Saurav brings a wealth of knowledge and experience, inspiring others to embrace open-source and contribute to its growth.\n","JobTitle":"Community Manager","PhotoFileName":"sauain.jpg"}]},{"title":"Turning Code Into Community: The Open Source Startup Experience","description":"Embarking on an open-source startup journey is like navigating through uncharted waters. The transition from a basic project to a community-driven, commercially viable initiative is rife with challenges, yet also incredibly rewarding. This talk aims to unravel the complexities and milestones of growing an open-source startup, featuring a behind-the-scenes look at Amplication’s transformation. We'll dive into essential elements such as building a robust community, striking a balance between commercial and open-source endeavors, and managing growth. Attendees will gain insights into critical turning points and decisions that can make or break an open-source startup.\n\n","category":null,"speakers":[{"FullName":"Saurav Jain","Company":"Amplication","Biography":"Saurav is an experienced Community Manager with a passion for open-source development. Over the past two years, he has been dedicated to fostering and growing a vibrant community of over 30,000 open-source developers. Saurav's expertise lies in running successful programs such as \"Issues for First Timers,\" which has facilitated the onboarding of hundreds of new developers into the world of open source.\n\nWith a strong online presence, Saurav has garnered a substantial following of over 40,000 on Twitter. He actively engages with the open-source community, sharing valuable insights, promoting collaboration, and advocating for the benefits of open-source software.\n\nSaurav's expertise in community management and his commitment to open-source development have earned him opportunities to speak at renowned conferences worldwide, including PyCon Ireland, PyCon Italy, FOSS Mumbai, OCD India, DevRel.com, and many more. As a speaker, Saurav brings a wealth of knowledge and experience, inspiring others to embrace open-source and contribute to its growth.\n","JobTitle":"Community Manager","PhotoFileName":"sauain.jpg"}]},{"title":"Unleashing Flutter's Potential with Firebase Remote Config","description":"Discover the untapped power of Flutter as we delve deep into Firebase Remote Config. Learn to adapt and evolve your app in real-time, ensuring an ever-fresh user experience. This talk is set to redefine how you view app flexibility and responsiveness. Get ready to elevate your Flutter development game","category":null,"speakers":[{"FullName":"Francesco Coppola","Company":"University of Trento","Biography":"Student of Human-Computer Interaction and a front-end developer. I'm passionate about UI and UX design, especially about new technologies and mediated social interactions. I also focus on my communication and innovation-related skills through extra-curricular activities, and I love open source!","JobTitle":"Flutter Developer","PhotoFileName":"belloccio.jpeg"}]},{"title":"Unraveling the Mystery: Transformers","description":"The word Transformer has become popular due to the appearance of different AI-based apps such as DALL·E 2, IMAGE, ChatGPT or Bard. These systems use Transformer-type deep neural networks that allow them to extract information from the context of the input words by using attention and self-attention techniques to generate the result.\n\nIn this talk, I will describe what a Transformer is, how it works, how we can build or reuse one to build our NLP or Computer Vision systems and see how they fit into the architectures of the new cognitive systems that seem to be revolutionizing the world of AI.","category":null,"speakers":[{"FullName":"Moisés Martínez Muño","Company":"Universidad Francisco de Vitoria","Biography":"Moisés Martínez is a Computer Engineer and PhD in Computer Science with majors in ​​Artificial Intelligence from the Carlos III University of Madrid. He has been AI researcher and\/or professor at different universities such as the Carlos III University of Madrid, the University of Örebro, Universidad Internacional de La Rioja, King's College London, Universidad Pontificia de Comillas and Francisco de Vitoria University. In addition, I am organizer of T3chfest and Madrid Google Cloud Developer group, speaker at different meetups and GDE on Machine Learning.","JobTitle":"Lecture","PhotoFileName":"moises_martinez_big.jpg"}]},{"title":"Web Vitals 2023: 9 Must-Knows for Developers","description":"Are you a web developer looking to elevate your projects to the next level? You need to hear this!\n\nCore Web Vitals are transforming the web, and we have the keys for you to get ahead of the curve.\nIn this presentation, we'll unveil the 9 most effective and groundbreaking optimizations for Core Web Vitals in 2023.\nImagine your website loading at lightning speed, interacting seamlessly, and offering impeccable visual stability.\nIf you want to be a leader in user experience and stand out on the web, you can't miss this talk.\n\nDiscover the strategies that are making a difference in the world of web development!","category":null,"speakers":[{"FullName":"Carlos Caballero González","Company":"DotTech","Biography":"He is a Computer Science Engineer and PhD. in Computer Science from the University of Málaga. Master in Software Engineering and Artificial Intelligence. He is an associate professor at the Open University of Catalonia and a Full-time teacher in vocational training at the Junta de Andalucía in Computing and Telecommunications. He has written several teaching books and more than a dozen research articles in the first international journals such as the publications in Solar Physics (A Comparative Study of Clustering Methods for Active Region Detection in Solar EUV Images, Automatic tracking of active regions and detection of solar flares on solar EUV images). He is an open source passionate and loves contributing in events.","JobTitle":"Professor","PhotoFileName":"me.jpg"}]},{"title":"What can you do to become a greener technologist? ","description":"As the world is heating up, technologists are changing to work in a more energy efficient way. These ways of working are small things that make a big impact. This talk is some actionable advice for different types of technologists (Web, Backend, DevOps and non-technical) who wish to be \"greener\" yet don't know where to start.","category":null,"speakers":[{"FullName":"Anna Rasburn","Company":null,"Biography":"Anna is a software developer at Morgan Stanley working in their API team. She first went there as a grad after graduating with a First in Computer Science from the University of Stirling. Although a large amount of her career has been spent at Morgan Stanley, she has also worked at the Startup 'Br-dge' in Edinburgh. ","JobTitle":"Software Developer","PhotoFileName":"whatsapp-image-2023-09-15-at-22.22.11.jpeg"}]},{"title":"What comes after ChatGPT? Vector Databases - the Simple and powerful future of ML?","description":"What comes after ChatGPT? Vector database projects like Weaviate, Pinecone, and Chroma recently got millions of dollars of funding for their projects. But what are vector databases? And why will they be so important in the future? \nLet us see how Vector Databases can help you define and run your machine learning business use cases. We will explore some real-world use cases and try to understand the potential of vectors and vector databases. \nNot exactly sure what a vector is ? No worries, you will learn everything you need about vectors .\nWe will also cover how vector databases can work together with chatGPT and helps you to overcome some limitations of chatGPT.","category":null,"speakers":[{"FullName":"Erik Bamberg","Company":null,"Biography":"Erik is a Java and machine learning Enthusiast - Java -Coach, -Expert, -Consultant and Software Architect - who loves to talk about elegant software solutions and the achievement from the 8-bit area to today.\nHe spends his energy, enthusiasm and research time in machine learning and vector databases.\nFormerly a Open Source Contributor & Community Lead for the Deep Java Learning ML Framework (Amazon AWS), he is on a mission to transform machine learning from the research labs into real-world applications.\nAs a musician and Indy Film Maker, he always sees elegant software solutions with the eye of an artist and knows about creativity and art and the importance of these skills as a software engineer.","JobTitle":"Senior Principal Software Developer","PhotoFileName":"erik2_smaller.png"}]},{"title":"What's new on Chrome web UI","description":"The web platform is evolving quickly, with UI features to improve developer experiences, create new responsive capabilities, and enable more accessible interface defaults. The aim of the talk is to give a high level overview of what you can get excited about in the UI space and look out for on the web platform for CSS and HTML. ","category":null,"speakers":[{"FullName":"Cleyra  Uzcategui ","Company":"JP Morgan & Chase","Biography":"Cleyra is a Venezuelan Software Engineer. Her passion for web development and user experience have led her to focus her career on creating products that are easy to use and accessible to everyone. She is also a promoter of diversity and inclusion in the tech industry and is always looking for ways to promote equal opportunity and representation, in her role as Women Techmakers ambassador, Women Developer Academy Mentor and in her role as Google Developers Group organiser.","JobTitle":"Software Engineer","PhotoFileName":"cleyra_profile.png"},{"FullName":"Delia Paternina","Company":"Charles River Laboratories","Biography":"Delia is a Full Stack Software Engineer with a background in Civil Engineering and video games testing.\n\nShe loves using her development skills and knowledge to bring innovation and improvement to others and make an impact through software.","JobTitle":"Software Engineer","PhotoFileName":"delia-profile.jpeg"}]},{"title":"Why you should learn Rust","description":"An overview of the programming language Rust and its strengths and weaknesses and how it compares to other mainstream languages and what makes it the most loved programming language in the annual stack overflow survey.","category":null,"speakers":[{"FullName":"Aidan Kelly","Company":"Barclays","Biography":"Graduate Software Developer at Barclays and recent graduate from University of Strathclyde with a degree in Computer Science.","JobTitle":"Graduate Software Developer","PhotoFileName":"1608574859097.jpeg"}]},{"title":"WordPress Beyond Basics: Developing and deploying a website from snatch in 60 minutes ","description":"Join us for an exhilarating journey into the world of WordPress as we go beyond the basics and dive headfirst into the exhilarating challenge of developing and deploying a fully functional website from scratch in just 60 minutes. In this action-packed session, you'll witness the incredible power of WordPress as we harness its capabilities to create a website that's not only visually stunning but also fully functional and ready for the world to see.\n\nBut there's more to the story. WordPress isn't just a tool; it's a force that's shaping the digital landscape. Did you know that WordPress now empowers nearly 43% of all websites on the internet? That's right, from small blogs to large-scale e-commerce platforms and everything in between, WordPress is at the heart of it all. Join us as we explore how this versatile platform is driving innovation, democratizing content creation, and revolutionizing the way we build and deploy websites. Whether you're a seasoned developer or just starting your journey, this session promises to inspire, inform, and leave you with the skills and knowledge to conquer the world of WordPress development like never before.","category":null,"speakers":[{"FullName":"Vinamra Sharma","Company":null,"Biography":"Vinamra Sharma has recently graduated with a master's degree in Computing Science from the University of Glasgow. He is a hackathon enthusiast, having clinched victory in over twenty-five hackathons globally, including prestigious events at MIT, Duke University, and UCR. Vinamra has generously shared his knowledge by mentoring at HackHarvard, BioHacks, and LaHacks, and he has served as a judge at TechTogether Boston. Beyond hackathons, his passion for research shines through with three international publications in machine learning and cybersecurity, earning him two best research paper awards from IEE and Springer, respectively.","JobTitle":null,"PhotoFileName":"vinamra.jpg"}]},{"title":"Year of 2023 - is argument to chose Flutter","description":"This talk will be based around Flutter progress in 2023 as well as job market situation in 2023. What happened and why it is a great time for Flutter to step in?\n2023 shows huge jump in Flutter development and huge support from the community as well as Google's side.\n2023 shows huge drop on a market capacity, lay-offs and budget cuts. \n\nThese two things are heavily connected, and I will tell you why.","category":null,"speakers":[{"FullName":"Vadym Pinchuk","Company":"Labrys","Biography":"I am a passionate mobile Software Engineer with Ukrainian origins, currently residing in London, UK. My journey commenced as an Android Developer in early 2012, and in 2018, I became an active member of the Flutter community.\nDuring last two years I worked as an Android Developer at Instagram, but now returned back to the tech stack I love as a Flutter Developer at Labrys.","JobTitle":"Senior Software Engineer","PhotoFileName":"vp_portrait.jpg"}]}]